[
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_1",
    "data": {
      "text": "Hey, everybody. Welcome back to the award winning Roadwire Fantasy Basketball podcast sponsored by Underdog, Vivid Seats, and Rival Fantasy. It's Thursday, October 26th. My special guest once again is NBC's Noah Rubin, my former coworker. Rick Kamla is under the weather today and will not be here. Noah and I are gonna break down a busy Wednesday night for y'all right after this jam. Hey. Noah, I've been podcasting for, like, 10 years, but I rarely ever hosted or did anything of importance. I"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_2",
    "data": {
      "text": "I've been podcasting for, like, 10 years, but I rarely ever hosted or did anything of importance. I just sort of showed up when they called me and started talking. So I always forget to do stuff like, say, remember to like and subscribe and and mash all those buttons that you can. So, yeah, it's just do do all that stuff, so we can we can keep this thing going. As I said, I'm trying I'm trying to be sick, but I keep fighting it off. Camla Camla's got the flu or something. So, Noah, part of the"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_3",
    "data": {
      "text": "be sick, but I keep fighting it off. Camla Camla's got the flu or something. So, Noah, part of the part of the problem is gonna be that you are so you answer my text so quickly, and you're always like, yeah. I can do it. Whatever. So it's just easy to ask you to do stuff when, when we're in a jam. So you might be getting more phone calls from me going forward. Fine by me. It's always fun potting with you and just talking about basketball, and now we have actual games to talk about instead of"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_4",
    "data": {
      "text": "with you and just talking about basketball, and now we have actual games to talk about instead of just speculating about what the season's gonna look like. Because when we go however many months it was with no games, eventually, we just we hit on all the points. Everything's gonna happen, and now we can say we were right on half of it and wrong on half of it. So that's pretty cool. Yeah. And what else is cool is I got a box in the mail yesterday, and it had this rotor world or had this rotor"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_5",
    "data": {
      "text": "else is cool is I got a box in the mail yesterday, and it had this rotor world or had this rotor wire god. I mean, it's 22 years, guys. That's fair. I had this RotoWire, pullover, Under Armour pullover in it, and I'm like, this is some sweet swag. I'm fired up. I put it on, even though I can't say the name right half the time. So thanks to Renowire for for sending me some stuff. I also got a hat. I haven't I haven't busted that out yet. Maybe a t shirt. No. If you keep doing this, as much as"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_6",
    "data": {
      "text": "I haven't I haven't busted that out yet. Maybe a t shirt. No. If you keep doing this, as much as you've done it lately, you you may even be in line for some Renowire swag as well. I won't complain about, more fantasy clothes. I I can't hear you back. Okay. Fantasy clothes. I like that. I have not heard not heard that term. Alright. No. So unlike you, I was sitting in my office last night with all 3 of my TVs going. The league pass is free right now, so you can literally watch every game if you"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_7",
    "data": {
      "text": "3 of my TVs going. The league pass is free right now, so you can literally watch every game if you want to. I was bouncing all over the place. I was having a good time. I I was having a a party in my office by myself just enjoying some hoops. I kinda envisioned you doing the same thing, but you just told me that you had a different plan last night. No. The, yeah. I mean, obviously, 99% of the time, I'm sitting in front of multiple screens watching all the games and writing about them. But last"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_8",
    "data": {
      "text": "I'm sitting in front of multiple screens watching all the games and writing about them. But last night, I was able to go up to Charlotte. It's about 2 hour drive from me and watch my hawks go and look freaking awful. Jaylen Johnson was fun. Sadik Bey played pretty hard, and I enjoyed watching him play. He got some steals that I don't expect to stick. But it's, it's not fun when you when you drive 2 hours to go watch your team and the guards, the 2 guards that are getting paid a ton of money"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_9",
    "data": {
      "text": "2 hours to go watch your team and the guards, the 2 guards that are getting paid a ton of money combined to shoot, what was it, 4 for 26? And, Yeah. Trey just jump things both look bad. Yeah. No other way of putting it. And, you know, Charlotte was fun. I enjoyed watching Charlotte, which was kinda cool. But, yeah, I wanna see more Jalen Johnson minutes, and I wanna see the Hawks play better basketball. But it was still a lot of fun and a lot of, fun fantasy guys that I've been talking about"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_10",
    "data": {
      "text": "But it was still a lot of fun and a lot of, fun fantasy guys that I've been talking about played pretty well between Mark Williams and PJ Washington. LaMelo was pretty fun to watch as well. So, hopefully, the Hawks can get more minutes for Kang Woo and more production from Trey and Dejounte. Those are my two requests. Kangaroo's minutes were a concern. Trey and D'Jante combined to shoot 7 well, Trey was 4 and 19. Okay. D'Jante was 3 of 14. It's too early for me to do math. That's 33, but"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_11",
    "data": {
      "text": "Trey was 4 and 19. Okay. D'Jante was 3 of 14. It's too early for me to do math. That's 33, but whatever. Too early. So they were they both just couldn't do anything, and they were they were 1 of 12 from from 3. Trey did make 14 and 15 free throws, so so he had that going for him. And he also had 9 assists, but just a just a weird night. Jalen Johnson is a guy that you were talking about last week. I mean, I think he's out there as a deep sleeper. If you're in the deep league right now, Jalen"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_12",
    "data": {
      "text": "I mean, I think he's out there as a deep sleeper. If you're in the deep league right now, Jalen Johnson was 9 of 13 21 points, 7 boards off the bench. He played, 29 minutes. Also had 2 steals in a block. So and he also looked good. Like, he they he'd be fit the eye test. And, if you're in a deep league and looking for someone to pick up off waivers today, let's say, some of the other big names are gone. I think Jaylen Johnson is at least wears a flyer right now, but you gotta have somebody"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_13",
    "data": {
      "text": "are gone. I think Jaylen Johnson is at least wears a flyer right now, but you gotta have somebody you're comfortable dropping. You can't just you can't just go you just can't give up on guys you drafted this quickly, for the most part. Yeah. I'm not expecting him to keep doing 21.7 boards, 2 steals, and a block, but he's gonna play a pretty large role off the bench. It's gonna be him, Saddiq Bey, and Deandre Hunter kinda cycling between the forward minutes there. So I think he played 29 minutes"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_14",
    "data": {
      "text": "and Deandre Hunter kinda cycling between the forward minutes there. So I think he played 29 minutes last night. I would expect 24 is probably more of a realistic number, but he was a lot of fun. Like, the Hawks have been really good offensively because of Trae Young, but they haven't had a ton of, like, really good transition play over the past few years. And, like, I just felt like Jaylen Johnson. I mean, I think it was towards the end of, you know, the Q1, the first half. He had, like, 3"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_15",
    "data": {
      "text": "I mean, I think it was towards the end of, you know, the Q1, the first half. He had, like, 3 straight dunks, or maybe he had 2. And and Bogdan Bogdanovic also had that poster dunk that came out of nowhere, but he is just a a one man fast break. He was getting steals. He did have a block, and it's just another element to the Hawks, offensively that they just haven't had. So he's gonna play big minutes. I don't know if he'll start because Saddiq Bey fits as kind of a floor space a little bit"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_16",
    "data": {
      "text": "minutes. I don't know if he'll start because Saddiq Bey fits as kind of a floor space a little bit more, and you kinda need as much spacing as possible when you have Clint Capela starting at center. But Jalen Johnson's gonna play enough of a role to be worth rostering, I think, in standard leagues even. Well and we're gonna talk more about, Jalen Johnson on Tuesday because my guest, instead of Noah, it's gonna be Bob Rathman, the voice of the Hawks. You guys are all gonna be hawksed out by the"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_17",
    "data": {
      "text": "it's gonna be Bob Rathman, the voice of the Hawks. You guys are all gonna be hawksed out by the time I'm done with you living in Atlanta and everything. But, yeah, Bob should be here Tuesday, and and he's always super fun. One of my favorite people to have on the show, so be sure to to check that out next Tuesday. Alright. Some of the good stuff that happened last night, some of the good league pass stuff, the Lucas 30 point triple double to open the season, despite his calf injury was pretty"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_18",
    "data": {
      "text": "pass stuff, the Lucas 30 point triple double to open the season, despite his calf injury was pretty sweet. The entire OKC Thunder lineup, Sands Chet Holmgren was pretty sweet. SGA, especially, was a monster. Kristaps Porzingis debut for Boston. Telling you, man, Boston is Boston's a team. That I think that's the one to beat. Porzingis was crazy good. Cade Cunningham scored 30. Zion Williamson made it through the whole game without getting hurt and put up pretty decent numbers. Some guy named"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_19",
    "data": {
      "text": "it through the whole game without getting hurt and put up pretty decent numbers. Some guy named Desmond Bane, that I got bashed for drafting. Drafting had, like, 31 points, a full stat line, 5 or 6 threes. He's the man. I don't think we need to break any of those guys down. They're not available in anyone's Fantasy League. The only thing you can do is go to underdog, bet the over on those guys. You know, you can also go to FanDuel. You can go wherever. But I've been playing a lot of underdog,"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_20",
    "data": {
      "text": "You know, you can also go to FanDuel. You can go wherever. But I've been playing a lot of underdog, Noah, and I I I won, like, like, $70 the first night, opening night. And then I, of course, swung for the fences and tried to win big money last night and was doing, like, 5 5 over 5 overs, which is essentially, like, a parlay. And I came close, but I'm I'm gonna get back and go a little more conservative tonight and and get some money back. But, man, Underdog Underdog is pretty fun. Cam Thomas"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_21",
    "data": {
      "text": "tonight and and get some money back. But, man, Underdog Underdog is pretty fun. Cam Thomas plays for the Nets. Alright? He set a record NBA record scoring 36 points off the bench in a season opener. He hit 8 3 pointers. He didn't do a lot else. I've got him in my 30 team league, which we were supposed to be breaking that down today. I think there's so much excitement with all these games and so many players to talk about. I don't know how much we're gonna get into that. One guy I had, I did"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_22",
    "data": {
      "text": "many players to talk about. I don't know how much we're gonna get into that. One guy I had, I did draft in that league was Cam Thomas, and then I put him on my bench for the week. So I missed out on the 36 point explosion. Do you have any Cam Thomas thoughts? I certainly have thoughts. I can't remember if I have him in any leagues, unfortunately. I remember after their first preseason game, I think he actually started that one because, I think Cam Johnson was out, and he started had a really"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_23",
    "data": {
      "text": "he actually started that one because, I think Cam Johnson was out, and he started had a really big scoring night. And I think maybe some people were excited and some people said, well, you know, we know he can score, but that's it. But it really kind of felt to me like, okay. Like, he's probably gonna be their 6th man and be in consideration for 6th man of the year. Because a lot of times, it's whoever can score the most coming off the bench is certainly at least in consideration. And he's not"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_24",
    "data": {
      "text": "can score the most coming off the bench is certainly at least in consideration. And he's not gonna average 36 points per game off the bench. But when he comes in the game, he's gonna have the green light to kinda shoot whenever he wants, especially if he has it going like he did in this one. So, no, you're not gonna get anything else aside from points. He'll be on the court enough to get, you know, some other stats here and there, but nothing consistent aside from buckets. And he's pretty good"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_25",
    "data": {
      "text": "some other stats here and there, but nothing consistent aside from buckets. And he's pretty good free throw shooter, pretty good at go at getting to the line as well. And points leagues, I think, is where you're gonna make your money on Cam Thomas. If you make money on Cam Thomas, because he's the most inconsistent Fantasy player I've maybe ever come across. You know, looking back at last year's game game log on January 11th against the Bulls, he had he played 1 minute and scored 0 points. The"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_26",
    "data": {
      "text": "game game log on January 11th against the Bulls, he had he played 1 minute and scored 0 points. The game before that, he played 1 minute and scored 0 points. Then on Friday, November 4th, comes out of nowhere, plays 32 minutes, scores 17. He has 21 the next night, and then 19 the next night. Then he goes for 6 points and 4 points. Then the minutes just die and go, he's down to 743, yadayadayada. All of a sudden on Saturday, December 10th, there's a 33 point explosion. And then it really gets"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_27",
    "data": {
      "text": "All of a sudden on Saturday, December 10th, there's a 33 point explosion. And then it really gets interesting in February. He went 44, 47, and 43 points in back to back to back games. And but then he disappeared again. There's a 2 point game. There's a 7 point game. There's a 0 point game. There's a 4 point game. So it's just all over the map. And and along with all of that, it's mostly just points and threes that he's getting. So, I'm super excited to have him in my 30 team league. I'm I'm"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_28",
    "data": {
      "text": "and threes that he's getting. So, I'm super excited to have him in my 30 team league. I'm I'm getting him in my lineup next week. And if I drafted him in a regular league, I'd be kind of excited about it too. I mean, how can you not be excited after a 36 point, opening night debut? But, do you think would you cut who would you cut players to pick him up? No? Would again, if you had Talen Horton Tucker who kinda struggled last night, who else who else would be droppable for? Like, Bogey"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_29",
    "data": {
      "text": "Horton Tucker who kinda struggled last night, who else who else would be droppable for? Like, Bogey Bogdanovic, maybe? Would would you drop Bogdanovic to pick up Cam Thomas? Maybe. I I think, Taylor and Horton Tucker, I I was actually talking about him with Zach the other day because people were asking about it in our in our q and a, And I didn't, even realize that he had been starting the preseason, so I checked that out. I was like, okay. Wow. He actually is starting and playing pretty well."
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_30",
    "data": {
      "text": "so I checked that out. I was like, okay. Wow. He actually is starting and playing pretty well. I didn't expect that to continue during the regular season, but evidently, it did after he started every single preseason game. So there's reason for optimism with Taylor and Horton Tucker. Even if he struggled in their first game, I don't think he's gonna be incredible. But I don't know if I'm dropping him quite yet, for Cam Thomas. But I think a guy like Bogey is a great example of somebody that's"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_31",
    "data": {
      "text": "him quite yet, for Cam Thomas. But I think a guy like Bogey is a great example of somebody that's kind of a a safe play that you may have gone in, like, the later rounds that okay. Like, he'll probably still be there on the waiver wire. Somebody with similar production will probably still be there on the waiver wire. Let me take the upside swing on Cam Thomas while I can. And then if it is, like you said, which is very, very possible and that it's inconsistent, like, he has 36, and then next"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_32",
    "data": {
      "text": "you said, which is very, very possible and that it's inconsistent, like, he has 36, and then next game, he shoots 2 for 11 and has 7 points. Like, that's very possible as well. He's an incredible score when he's on. And when he's not hitting shots, it's frustrating. So I would take the upside swing, might as well, because, like, I mean, like, what if what if he becomes more consistent and then he averages 20 points per game off the bench this season? I think that's a lot more valuable than what"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_33",
    "data": {
      "text": "averages 20 points per game off the bench this season? I think that's a lot more valuable than what Bogey's gonna give you that pretty consistent just estimating 13 points per night. So Yeah. I like that. And, yeah. So, I mean, if you got a guy at the end of your roster who let's say you you drafted Miles Bridges. I think he's and you know, you just go go pick up the hottest reunion you can find, which in many cases maybe maybe can. Speaking of Taylor Horn and Tucker last night, there were"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_34",
    "data": {
      "text": "which in many cases maybe maybe can. Speaking of Taylor Horn and Tucker last night, there were several things I did not like about what went down. The fact that he only had 8 points, almost all of them in the first half. I did not enjoy that. He only had 4 assists. He only hit 3 of 9 shots, and he only played 22 minutes. I was kind of going all in on on THT at the end of last week. I had him in FanDuel. I had him in some some, underdog stuff. I've got him on some fantasy teams. So he was hugely"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_35",
    "data": {
      "text": "I had him in some some, underdog stuff. I've got him on some fantasy teams. So he was hugely disappointing, but he started at point guard all preseason for this team. It didn't work out last night, but I'm I think you've at least gotta give THT till the end you know, beginning of next week before you're you're dropping him, just because of the expectations we had coming in. So I think it's too early. Yeah. And those like, looking at the minutes, like, it was a pretty weird game for Utah. I"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_36",
    "data": {
      "text": "early. Yeah. And those like, looking at the minutes, like, it was a pretty weird game for Utah. I haven't gotten to go back and, like, really look at what happened, but only Markkanen only played 31 minutes. Walker Kessler only played 22. Looks like a bunch of bench guys played about 2 and a half minutes, so maybe we can add that on in a closer game. He doesn't got blown out. So Yeah. And, I mean, they gave 10 guys rotation minutes, and I think that's kinda what happens is a lot of teams are"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_37",
    "data": {
      "text": "they gave 10 guys rotation minutes, and I think that's kinda what happens is a lot of teams are probably going with more of a 9 man rotation, but they gave 10 guys, rotation minutes this time. Chris Dunn and Colin Sexton play Chris Dunn played almost 16 minutes. Colin Sexton play almost 20. I think that I mean, if you're trying to guard De'Aaron Fox, like, Chris Dunn's probably their best option to guard Fox. And I don't know. I again, I haven't really gotten to look back at at what their"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_38",
    "data": {
      "text": "to guard Fox. And I don't know. I again, I haven't really gotten to look back at at what their matchups were, but I think they're trying to slow down, this high octane king's offense, then maybe THT isn't the best option for that. Maybe that limited his minutes at times. I guess I I'd probably be giving it another game or 2 before I'm all ready to drop THT if you bought in on him enough to, to draft him. I I mean, I didn't anywhere, but, I think that if you took the late round swing on him,"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_39",
    "data": {
      "text": "draft him. I I mean, I didn't anywhere, but, I think that if you took the late round swing on him, give it a few more games. Well, THT reminds me a little bit of, Boris Dio back in the back in the day. Boris Dio gained a bunch of weight towards the end of his career, and we used to make fun of him eating Big Macs and stuff. And and THT is not a small dude. Like, he's got some girth. He's gonna have trouble staying in front of some of these some of these guards probably, but he's also really"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_40",
    "data": {
      "text": "have trouble staying in front of some of these some of these guards probably, but he's also really good offensively, and and and I I think he's gonna bounce back in the next game. A funny thing happened on the way to my, Victor, Wimmen, Yama, parade celebration last night as I, built my whole day around that. Derek Lively comes out of nowhere for the Mavericks. Not out of nowhere, but sort of out of nowhere. I mean, we knew he was he was gonna play for them a little bit because they really"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_41",
    "data": {
      "text": "out of nowhere. I mean, we knew he was he was gonna play for them a little bit because they really don't have big men that they can put out there. But Derek Lively came off the bench to start the game, but they quickly realized that that was a mistake. He needed to start, so he started the second half and actually kind of blew up and had a a big game. He was making plays on both ends of the floor. He had an incredible put back dunk Mhmm. In traffic that that did not look like something a rookie"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_42",
    "data": {
      "text": "He had an incredible put back dunk Mhmm. In traffic that that did not look like something a rookie would do, and he he battled with, Zach. What's this? Zach Collins. And the Mavericks desperately need a big man who can score and play defense to complement Luca and Kyrie. And, as great as Luca was last night, as fun as Wembley was in the second half of that well, in the Q4 is really when he came alive. Derek Lively really impressed me last night. I think he's he's gonna be bannered around in the"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_43",
    "data": {
      "text": "Derek Lively really impressed me last night. I think he's he's gonna be bannered around in the rookie of the year chatter, and it's only one game. I know that. I still think when he's gonna win it, I still think Chet's gonna be dominant, but Lively looked great last night. He really did. And I remember getting the notification and saying that Jason Kidd was rolling with Derrick Jones junior and Maxi Kleba in the starting unit. And I was like, that is doesn't it doesn't make sense. Like, you're"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_44",
    "data": {
      "text": "Kleba in the starting unit. And I was like, that is doesn't it doesn't make sense. Like, you're going against 17 foot 47 foot 5 Victor Wembanyama at power forward. So they are they also have Zach Collins down there at center. And they said, you know what? We're gonna go with Kleba to kinda guard the starting center, and Grant Williams who I'm is an undersized power forward. Like, I I I wanna say 67, 65, something like that. Like, he's pretty he's a smaller power forward, and he's a really good"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_45",
    "data": {
      "text": "67, 65, something like that. Like, he's pretty he's a smaller power forward, and he's a really good defender, but it's like, you probably need a little bit of size down low. And Lively had started all preseason. So then he figured it out. Okay. Derek Lively and Josh Green makes more sense than Derek Jones senior Maxiclippa. Cool. We figured that out. But to me, it was, okay. Lively is gonna be a solid fantasy option because he's a rookie. Should have some good games. Should have some bad games,"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_46",
    "data": {
      "text": "fantasy option because he's a rookie. Should have some good games. Should have some bad games, but he's starting. And a lot of the rookies aren't really getting minutes to start their careers because a lot of them went, to places that have a lot of depth. But he was able to come off the bench and play really well, so that was really encouraging to me. It's not just an opportunity based thing. Like, he was awesome. So, I mean, a double double, he played 31 minutes almost, but I'd be very shocked"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_47",
    "data": {
      "text": "he was awesome. So, I mean, a double double, he played 31 minutes almost, but I'd be very shocked if he wasn't in the starting unit for their next game. Yeah. I mean, I I I did a rotor wire mailbag column last night. It should be posted anytime now. And I I got, like, 3 different, Derek Lively questions, and my my comment on all of them was the Mavericks need this guy. Like, they need him right now. They don't they don't have anybody else really that they can throw out there and play Center."
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_48",
    "data": {
      "text": "now. They don't they don't have anybody else really that they can throw out there and play Center. That's going to do what he does. So, I mean, I think it's trial by fire. I think he showed, you know, his coach and Mark Cuban and Luca and everybody else a lot last night. And and, it was pretty cool. One of the stories that night, I think. The entire San Antonio Spurs team was pretty much as advertised know. Like we knew Collins was going to be good, right? He's gonna be a solid fantasy Center."
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_49",
    "data": {
      "text": "know. Like we knew Collins was going to be good, right? He's gonna be a solid fantasy Center. We know point. So hand was going to be fun. The guy had the ball in his hands. The whole night didn't shoot it very well, but he was super fun. I wasn't sure about Kelvin Johnson, but Kelvin Johnson looked good 7 or 9 boards and 7 assists, which is freakishly high for him and very encouraging. Wamebanyama, slow start, some foul trouble, was just doing that Porzingis on Dallas thing where he spent all"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_50",
    "data": {
      "text": "slow start, some foul trouble, was just doing that Porzingis on Dallas thing where he spent all of his time outside the the three point line as you, I think, may have suggested would happen in the day with doctor a podcast. But then in the Q4, he started mixing it up. He got down low. He started he started making some midrange and and, and did some cool stuff, made a bunch of threes. And then Devin Bassil was playing on a different level than everybody else out there. I felt like, at least on"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_51",
    "data": {
      "text": "Bassil was playing on a different level than everybody else out there. I felt like, at least on the Spurs. He had 23, 5 boards, 3 assists, 2 steals. If he drafted Devin Bass on fantasy, I think you gotta feel pretty good about yourself right now. Yeah. I mean, we have been talking about, you know, all the hype gonna be surrounding 1 b, but point so ham was fun. Maybe we were wrong. Maybe it's point Keldon. I don't know. He did have more assists, but it it probably is more long term gonna be"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_52",
    "data": {
      "text": "point Keldon. I don't know. He did have more assists, but it it probably is more long term gonna be point Sohan. I don't suspect that Keldin Johnson is gonna continue to do, borderline triple double stuff. But he was, like, able to have that level of production. That's pretty encouraging, maybe a little bit more well rounded than he's been in the past where he's just been a points guy. Zach Collins, aside from not giving us any threes, like, pretty well rounded game. Not as many rebounds I"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_53",
    "data": {
      "text": "aside from not giving us any threes, like, pretty well rounded game. Not as many rebounds I would have expected as well, but, it's only one game. Devin Vassell, as good as we've been talking about for a while now. We've been very high on him. I think a lot of people in fantasy basketball have been got paid, and now it looks like he's ready to kinda take off. I'm if he keeps up this level of production, the Devon Basel all star campaign is gonna start very early, for me. And then, Wembley, yes,"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_54",
    "data": {
      "text": "the Devon Basel all star campaign is gonna start very early, for me. And then, Wembley, yes, foul trouble. Another guy I just wanna mention real quick was Trae Jones. A lot of people were ready to man. That's right. Were ready to drop him. And I I was like, well, he's still gonna play enough minutes to provide some value. 16 points, 5 board, 6 assists. He showed a little bit of a 3 point shot during the preseason and showed it again last night. Like, he wasn't known as a shooter, 1st couple"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_55",
    "data": {
      "text": "during the preseason and showed it again last night. Like, he wasn't known as a shooter, 1st couple years and then has I mean, added that element to his game a little bit. Not gonna give you a ton of value from there, but that makes him more dangerous on the floor. It will help him be on the floor and just be more productive. So I I was pretty excited to see him, give that level of production last night as well. Well, and he also came through with big shots and big moments in that game. That"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_56",
    "data": {
      "text": "night as well. Well, and he also came through with big shots and big moments in that game. That game was tight all the way all the way through Trey Jones, you know, he lost the starting job. He could have pouted sat on the bench and and moped and and been, you know, this is not what I wanted and I'm not happy about it, but he came in and he also gave them really meaningful minute minutes. I think, I think the Spurs are going to be better than we think they're going to be this year. I think the"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_57",
    "data": {
      "text": "I think the Spurs are going to be better than we think they're going to be this year. I think the Mavericks are are still they still are prob they have problems on that team. They they have some problems. But, I mean, Luca was all world, and Lively came through. And and Kyrie hit a huge open 3 off of Luca Pass, and, they got the win. But fun game to watch. Cool cool that it was on national TV, and everybody got to see it. What else we got? We got you know what I'm gonna do? I'm gonna read this"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_58",
    "data": {
      "text": "everybody got to see it. What else we got? We got you know what I'm gonna do? I'm gonna read this first ad and get that out of the way. And it's my new favorite thing, underdog. Fantasy is the number one platform for NBA basketball and DFS player pick them contest. If you haven't tried underdog yet, new underdog users receive a first time deposit bonus up to $500 and a free 6 month subscription to rotor wire with promo code RW NBA. That's promo code RW NBA. Visit underdogfantasy.com or download"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_59",
    "data": {
      "text": "rotor wire with promo code RW NBA. That's promo code RW NBA. Visit underdogfantasy.com or download the Underdog app today and use promo code RW NBA to claim your free rotor wire subscription and deposit bonus. I'm not just here to read the ad. I actually play underdog. It's fun, and it's cool. I like it. So check it out. Who else we got? No. There's so many names we got through from last night. We probably do this all day. Max Struss, one dimensional three point shooter who doesn't do anything"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_60",
    "data": {
      "text": "probably do this all day. Max Struss, one dimensional three point shooter who doesn't do anything else comes out of the heat gate with 27 points and 12 boards and a bunch of threes. Was Max Struss drafted in every league, do you think? I I don't know what his, percentage of roster ship is. I I should've looked at that. Honestly, I I think I may have taken him in it may have just been a mock, like a late round in one draft, and I think that may have been it because he is pretty one dimensional,"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_61",
    "data": {
      "text": "a late round in one draft, and I think that may have been it because he is pretty one dimensional, generally speaking. Obviously, he played 39 minutes last night, had 27 points, 12 boards, a steal, and a block along with the 7 threes. And I don't know. I guess you're pulling up his roster ship for some time. But he, like, he's gonna play big minutes in Cleveland. But even though he had a monster double double last night, I don't know that I'm ready to add him off the waiver wire. I think,"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_62",
    "data": {
      "text": "double double last night, I don't know that I'm ready to add him off the waiver wire. I think, expecting this level of production from him consistently is gonna be asking a lot. Obviously, the rebounds aren't gonna be there, with much consistency. He didn't like, no Jared Allen there. I guess he was able to step up a little bit to help them out there. Evan Mobley wasn't as good on the glass as we may have expected. I think it was more of just like a really good opportunity, really good game for"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_63",
    "data": {
      "text": "may have expected. I think it was more of just like a really good opportunity, really good game for him, but I'm not gonna buy the hype and expect him to be like, he probably is I I guess I shouldn't say I'm not ready to pick him up off the waiver wire because he probably is worth rostering based on playing a large role and giving you a lot of threes. But that level of production is gonna be something that if you're expecting that or anywhere close to that, you're gonna fall very short of that."
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_64",
    "data": {
      "text": "that if you're expecting that or anywhere close to that, you're gonna fall very short of that. So if you're desperate for threes, cool. Like, he provides that spacing element to a team that felt like they had 4 really good players and were just missing 1 piece last year. Like, he fits perfectly. I know I I said that at some point, during the off season. He fits that role perfectly. But aside from threes, you're not gonna get much else, with any sort of consistency. So if you played him in any"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_65",
    "data": {
      "text": "threes, you're not gonna get much else, with any sort of consistency. So if you played him in any sort of DFS lineup last night, congrats. Great job. But I don't know what else he's gonna give you this season other than threes. He's not gonna come out here and average a double double. Well, I was on my way to find out what his ownership or roster ship percentage is, but ESPN has decided to start kicking me out of my login and makes me log back in. Oh, I think I'm I think I'm in. So, yes, I will"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_66",
    "data": {
      "text": "me out of my login and makes me log back in. Oh, I think I'm I think I'm in. So, yes, I will find that in a second. So he's in on Yahoo, he's 41%. 41. On Yahoo. So he's available in 60% Yahoo Leagues. And then in ESPN, he is I had him pulled up once. It's amazing. I can stream video from my house, but I can't pull up, pull up a website. Is it really worth all this trouble to find out what Max Drus is, at? I don't know. It's it's the the question of the day right there. We're gonna find out."
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_67",
    "data": {
      "text": "Drus is, at? I don't know. It's it's the the question of the day right there. We're gonna find out. We've gone this far. We can't turn back now. We we need to know. We're so close. I'm there. 12.8%. Oh, wow. ESPN. So Max Threus, I mean, after that game, I'm taking a flyer. Steel and a block and 12 rebounds and 2 assists and a bunch of others. You know, a lot of points, a lot of threes. It's it's probably worth a flyer. Who else is good? Kevin Love. 13 points, 10 boards, 3 triples for the Heat."
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_68",
    "data": {
      "text": "probably worth a flyer. Who else is good? Kevin Love. 13 points, 10 boards, 3 triples for the Heat. Are you surprised that Kevin Love is still somewhat relevant after day 1 of the NBA season? Not necessarily surprised by it. I mean, we knew it was gonna be him or Caleb Martin starting at PowerForward. It seemed like they kind of had a little bit of a minute split going. He could still shoot, obviously, and he's his rebounding was never about athleticism. It was about being really good at boxing"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_69",
    "data": {
      "text": "and he's his rebounding was never about athleticism. It was about being really good at boxing out. I don't think he's weak now just because he's a little bit older. So it also just I mean, looking at some of the numbers, there was a lot of rebounds to kinda go around. I mean, the Heat shot 40.2% as a team, and the Pistons shot 44.6. Jalen Duran and Isaiah Stewart had 14 rebounds in that game. Jimmy Butler had 13. So a lot of rebounds to go around. So not super surprised. I think this is"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_70",
    "data": {
      "text": "Jimmy Butler had 13. So a lot of rebounds to go around. So not super surprised. I think this is probably gonna be not something we expect consistently, but, like, probably Pete Kevin Love this season. He might have a game or 2 where he just, like, goes off and hits 8 threes because he randomly does that once a year. But pretty consistently, a couple threes and decent rebounding numbers is something I think to expect. So still having, like, having him on your roster, I don't think is a bad idea,"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_71",
    "data": {
      "text": "I think to expect. So still having, like, having him on your roster, I don't think is a bad idea, just because he'll be rather I think he'll be on the more consistent side as far as, like, that level of production. But cons like, double doubles with 3 threes, I don't think that's something that will happen often, but, you know, maybe 7 rebounds and a and a 3 and a half is something that he can average. I'm probably not picking up, Kevin Love. At least not now. I'm probably not big enough"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_72",
    "data": {
      "text": "can average. I'm probably not picking up, Kevin Love. At least not now. I'm probably not big enough anybody right now. I'd Yeah. I looked over my rosters. I don't really have anybody I I really want to drop just yet. 2 more THT games like that, I might get there. The game you were at PJ Washington at 25 points, Mark Williams, everybody's favorite breakout center at 13 points, 15 boards, 3 steals, and a block. I don't think there's a lot to say there. Those guys should have been drafted almost"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_73",
    "data": {
      "text": "and a block. I don't think there's a lot to say there. Those guys should have been drafted almost everywhere. If PJW is sitting on your waiver wire, though, you should probably pick him up. I will say that. Yeah. Any anything to add there? No? Mark Williams, like, the stats were good, but he just looked really dominant down there. Like, Clint Capela isn't a bad center. Like, I know he's not a like, nobody wants to talk about Clint Capela in fantasy because he's kinda like that traditional"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_74",
    "data": {
      "text": "a like, nobody wants to talk about Clint Capela in fantasy because he's kinda like that traditional center skill set that nobody gets excited about. But he's a good rebounder and a good center, and Mark Williams looked phenomenal against him. So he passes the eye test as well as putting up really good numbers. And then PJ Washington averaged, I think, about a steal and a block last year and didn't give us either in this game, but still had a really good game. So I expect he he can. And he only"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_75",
    "data": {
      "text": "give us either in this game, but still had a really good game. So I expect he he can. And he only was 1 for 6 last night, but we know he can shoot better than that. So he had a good game, but he can be even better than he was, which is kinda crazy. Moving on to Indiana, my Pacers who I'm who I have high expectations for this this season. I've been predicting big things for Bruce Brown. I've told you guys and everybody else to take Bruce Brown with your last your last pick or at at the end of"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_76",
    "data": {
      "text": "you guys and everybody else to take Bruce Brown with your last your last pick or at at the end of your draft. Bruce Brown came through 24 points and a career high 6 three pointers. The Pacers won easily, looked really good top to bottom. Buddy Heald, who people are worried about, getting traded or being disgruntled, came off the bench, at 14 points, 5 assists, 4 3 pointers in 25 minutes. I think Buddy Hield is gonna get on board with this. The Pacers just announced this morning. They signed"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_77",
    "data": {
      "text": "Buddy Hield is gonna get on board with this. The Pacers just announced this morning. They signed Rick Carlisle to a long term contract extension. The the the key pieces are in place for this team to be really, really good in the next 5 over the next 5 years, and they're gonna be good. This year, they're my my super bold prediction to win the East, you know, if you had to make something crazy. And prediction wise, that that to me is a crazy bold prediction. But, anyway, I'm a big fan. And, if"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_78",
    "data": {
      "text": "prediction wise, that that to me is a crazy bold prediction. But, anyway, I'm a big fan. And, if Bruce Brown went undrafted in your league, you might wanna go check the waiver wire. Definitely. And Buddy Hill was really good. I think I just had to confirm this real quick, but he's never played in the playoffs still. So, like, the Pacers should make the playoffs this season based on, I think, what everybody kind of expects. Like, I'm expecting at least the postseason. So he has a chance to do"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_79",
    "data": {
      "text": "everybody kind of expects. Like, I'm expecting at least the postseason. So he has a chance to do that. I've I've he's still gonna be playing a really big role off the bench. Not surprised at all that he seems to have kind of bought in a little bit. And, man, everything looks good, I guess, when you're playing the Wizards. So I guess when you have guys that are playing Washington this season, make sure they're in your lineup. If you're playing DFS, get those guys playing the Wizards. I saw"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_80",
    "data": {
      "text": "make sure they're in your lineup. If you're playing DFS, get those guys playing the Wizards. I saw someone tweet basically saying, okay. If you're if you're betting, just take the over in every single Wizards game. Like, I think to start the year until they make it, they kind of adjust a little bit. It might not be a bad idea, to just kind of take the over on the team that doesn't play defense, but plays a lot of offense. There's I mean, I remember having conversations where people are saying"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_81",
    "data": {
      "text": "but plays a lot of offense. There's I mean, I remember having conversations where people are saying they might average 125, 130 points a game and give up 135. Well, after game 1, it kinda seems like that. Yeah. And Jalen Smith also played limited minutes for the Pacers, but he looked he looked last night like we thought he would look last year when he was the starting power forward. He was very active. He was all over the place, and he played really well. I think he's gonna earn more minutes as"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_82",
    "data": {
      "text": "He was all over the place, and he played really well. I think he's gonna earn more minutes as the season progresses. If you're in a deep league, I think Jalen Smith, should be on your watch list right now. Couple other guys, Emmanuel Quickley went off for 24 and 6 for the Knicks. The Knicks almost pulled off the upset against Boston, which would have been interesting. Beef Stew had 14 and 14 for the Pistons. Jalen Duran had 17 points, 14 boards, 4 blocks. That guy has come in as advertised."
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_83",
    "data": {
      "text": "the Pistons. Jalen Duran had 17 points, 14 boards, 4 blocks. That guy has come in as advertised. Wiseman did not play. Baggs was quiet with 8 and 8. If you draft if you somehow have Wiseman on your team, he's a guy you could drop for a hot free agent, I think. My guy my other guy, my other late season, deep pick was Denny Schroder over there playing point guard for the Raptors down. A 22 point, 7 assists, 4 3 pointers, played a lot of minutes. Nobody else is playing point guard in Toronto for"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_84",
    "data": {
      "text": "7 assists, 4 3 pointers, played a lot of minutes. Nobody else is playing point guard in Toronto for now. So I think that's, I think Schroder Schroder is gonna be kind of fun. The the journeyman that just won't go away. Kobe White, kind of a rough night. Didn't shoot it very well. He's 4 of 14. He did finish with 15 points, 4 boards, 4 assists, 2 threes, starting for the Bulls at point guard. Didn't look as good as I wanted him to. I also think there were some opening night jitters going on"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_85",
    "data": {
      "text": "Didn't look as good as I wanted him to. I also think there were some opening night jitters going on there. And that's the thing. This is opening night for all these guys, so you can't you can't expect them just to come out and be totally in a comfort zone. So I was okay with what Kobe White did. I've I've got a lot of in lot of invested in in Kobe White. Xavier Tillman looked good for Memphis. Harrison Barnes went nuts for the Kings even though he's, like, 47 years old. John Collins had a"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_86",
    "data": {
      "text": "Harrison Barnes went nuts for the Kings even though he's, like, 47 years old. John Collins had a double double for Utah. Malcolm Brogdon played good played very well for Portland off the bench. And Bones Hyland I don't even know who Bones Hyland plays for. Noah. The Clippers. He was really good off the bench. The late game. He had a big game off the bench for the club. I mean, every time I hear Bones Hyland, all's I can see is Denver Nuggets. Like, it never it that'll never change for me."
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_87",
    "data": {
      "text": "Bones Hyland, all's I can see is Denver Nuggets. Like, it never it that'll never change for me. They'll be locked in forever. And then I've got some guys who didn't do so well listed here, and we've pretty much already hammered them, Trey D'Jonte and THD. So let's go on to another let's talk about Vivid Seats for a second. The NBA season is here. On behalf of our friends at Vivid Seats, let's get one thing clear. Nothing beats seeing your favorite team crush it on the court to the sound of"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_88",
    "data": {
      "text": "get one thing clear. Nothing beats seeing your favorite team crush it on the court to the sound of thousands of screaming fans. Every dunk, dribble, and every heart pounding play of your favorite team live and in person. Because Vivid Seats is the only ticketing company where you can earn rewards on every purchase, you can score amazing deals and unrivaled annual rewards all season long. Plus, with a 100% buyer guarantee, you'll be sure your ticket will be as legit as your love for the game."
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_89",
    "data": {
      "text": "with a 100% buyer guarantee, you'll be sure your ticket will be as legit as your love for the game. Visit vividseats.com or download the app today and use promo code ROTOWIR for $20 off your first $200 purchase. It's promo code RotoWire for $20 off your first $200 ticket purchase. Download the app or visit vividseats.com. Vivid Seats. Experience it live. No. Let's we got we got maybe, where are we at? We're 30 we got about 7 minutes left in this podcast according to my my rule. Talk to me about"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_90",
    "data": {
      "text": "at? We're 30 we got about 7 minutes left in this podcast according to my my rule. Talk to me about Thursday night. We have 2 games in the NBA tonight. Right? We've got the sixers at Bucks, and we've got the Suns at Lakers. We do. It'll be the first time we get to see the, new look Bucks and this Sixers team, sans James Harden. There was reports that he had his bags packed and was ready to join the team, and they told him to just stay home. So not to, question anything because there was a report"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_91",
    "data": {
      "text": "team, and they told him to just stay home. So not to, question anything because there was a report that came out that said something that, he was tending to his mom who was ill. And, like, obviously, we don't know for sure about that because it's a report. Like, I'm not questioning whether that's real or not, but it does seem kind of fishy. That report comes out. He tries to join the team and they tell him to stay home because it would it seemed like if that was a legit report that if he were"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_92",
    "data": {
      "text": "tell him to stay home because it would it seemed like if that was a legit report that if he were to say, hey, guys. I'm ready to play now, that they would say, yeah, please. Like, if that was, like, really the reason. So kind of fishy there, but no James Harden. There was another report that came out that said the Clippers are gonna kinda back off on trade talks for him. So if you, were taking a flyer on James Harden in round 4, you might have to wait a little bit longer, hopefully, not too"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_93",
    "data": {
      "text": "a flyer on James Harden in round 4, you might have to wait a little bit longer, hopefully, not too much longer, before we get to see him play for at least somebody, hopefully, somebody. But, I think, you know, we should see big nights from Embiid, De Anthony Melton, Tyrese Maxey. But more importantly, we get to see Damian Lillard play a regular season game for the Bucks alongside Giannis, alongside a healthy Khris Middleton, which is exciting. I I feel like they've done this the past few years"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_94",
    "data": {
      "text": "a healthy Khris Middleton, which is exciting. I I feel like they've done this the past few years where they've had some games on opening night, and then everybody plays the next night. And then we have to wait to see the Bucks and Sixes play on Thursday. I feel like that's happened a couple years in a row now, but I'm glad that they kinda waited for this matchup. So now national TV, only 2 games tonight, and I can focus on both of those and really get to, digest what's happening in the first"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_95",
    "data": {
      "text": "tonight, and I can focus on both of those and really get to, digest what's happening in the first one, and as well as the Suns Lakers, which, if I'm not mistaken, McGoldy and Jared Court again and Bradley Beal are doubtful. Right? Bradley Beal not gonna play. So who steps up in their place for Phoenix? Because that's that's the big stream for the stream of the night is gonna be whoever steps up. And Bradley Beal didn't play in game 1, and a lot of us went, with Goodwin. A lot a lot of us went"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_96",
    "data": {
      "text": "And Bradley Beal didn't play in game 1, and a lot of us went, with Goodwin. A lot a lot of us went with Grayson Allen, and none of that really happened. I think it was Ika Kody who actually played better than than those guys. So I'm trying to figure out what's gonna happen tonight because Booker not being on the court is huge. And he's sort of the point guard right now, so that leads me to believe Goodwin Goodwin may may be the guy. He might. I think, I mean, Grace Allen stepped in the starting"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_97",
    "data": {
      "text": "Goodwin Goodwin may may be the guy. He might. I think, I mean, Grace Allen stepped in the starting unit. Joshua Kogi didn't expect him to do as well as he did, but he had a really good game. But I don't know that I'm really it it's hard to pinpoint this early in the season. Okay. Exactly who's gonna step up and play and have a really good game. Like, somebody 1 or 2 players are probably gonna play a larger role and be more productive than we expect. Hard to really predict for the Suns at this"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_98",
    "data": {
      "text": "a larger role and be more productive than we expect. Hard to really predict for the Suns at this point because it's basically a full new roster, and we only have one sample size of a game. And Eric Gordon played 32 minutes. Grey Sound started and played 21, and Jordan Goodwin played 14 off the bench. I'd imagine Goodwin plays more. I wouldn't be surprised if they just moved Eric Gordon into the starting unit, though, based on what the minutes look like, and Jordan Goodwin plays off the bench. I"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_99",
    "data": {
      "text": "unit, though, based on what the minutes look like, and Jordan Goodwin plays off the bench. I I think it's I just it's gonna be a big Kevin Durant game, and that's probably the only lock that you can say is that KD is gonna shoot the ball a lot. He shot 22 times in their last game, played 37 minutes, and now you're taking out Devin Booker's 21 shots. I wouldn't be shocked if it was 25 or more shots from KD. Maybe, like, maybe even bordering on 30 shots, but also him having a little bit more of a"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_100",
    "data": {
      "text": "from KD. Maybe, like, maybe even bordering on 30 shots, but also him having a little bit more of a playmaking responsibility. So to get Eric Gordon, Graceland, try and get them going from deep, but it's hard to say exactly who's gonna step up. I like when what Jordan Goodwin did with Washington last season when he was able to play a larger role and get some steals, but, fingers crossed. I like Jordan Goodwin, but I don't know for sure. If he starts, I think I like him, but if not, then, I like"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_101",
    "data": {
      "text": "Goodwin, but I don't know for sure. If he starts, I think I like him, but if not, then, I like I like the obvious takeaway though that it is gonna be a Kevin Durant game, which is true because you you can't have all the big names in your FanDuel lineup tonight because you're gonna wanna have Giannis, you're gonna wanna have Joel Embiid, and you're like, Kevin Durant's got that big bald spot on top of his head, and he's old. And I just don't think I want Durant. But with no Beal and no, Booker,"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_102",
    "data": {
      "text": "of his head, and he's old. And I just don't think I want Durant. But with no Beal and no, Booker, Durant is you have to play Durant almost, so that's gonna be that's gonna be interesting to see how that goes down. Should be should be a pretty fun 2 game night. We didn't even talk about the Lakers. Is Anthony Davis going to get back in our good graces after that ridiculous disappearing act he pulled the other night? Like, didn't score a point in the second half. Yeah. I, I'd be very, very"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_103",
    "data": {
      "text": "pulled the other night? Like, didn't score a point in the second half. Yeah. I, I'd be very, very surprised if Anthony Davis didn't do better against Yousef Nurkic than he did against, Nikola Jokic and the the Nuggets. However, like, Jokic is a like, he's not a horrible defender, but he's obviously more known for his offense, and he's a competent defender, I'd say, like, pretty easily. But if it's Anthony Davis, you're expecting him to have good games against pretty much everybody because he's"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_104",
    "data": {
      "text": "Anthony Davis, you're expecting him to have good games against pretty much everybody because he's that level of a player when he's on the court. But I'm expecting him to bounce back after a really bad second half and a much better matchup with a Phoenix Suns team that has Nurkic, and they have Drew Eubanks. Yeah. If the other day, this is better. It it's it'd be pretty disappointing. Drew Eubanks. And you you you a lot of you are too young to remember this, but Bob Eubanks used to host the"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_105",
    "data": {
      "text": "And you you you a lot of you are too young to remember this, but Bob Eubanks used to host the dating game. Or, no, the honey I don't even remember what it's called. Whatever the was it the honeymooners? Newlywed game. Bobby Umanks, newlywed game. There it is. Rival, LeBron versus Jordan, Magic versus Bird, Barkley versus McHale, basketball synonymous with legendary player rivalries. They make the game more fun and give fans the storylines that raise the stakes every time those players meet on"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_106",
    "data": {
      "text": "game more fun and give fans the storylines that raise the stakes every time those players meet on the court or come up in conversation. Now every player matchup and head to head debate can be settled on rival fantasy. This NBA season, you can play challenges where you decide which NBA player will score more fantasy points in their next game. Play the rival fantasy in house challenges or create your own get a friend in the mix with customizable social challenges. Sign up at"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_107",
    "data": {
      "text": "or create your own get a friend in the mix with customizable social challenges. Sign up at joinrival.com/rhodowire now and get a $200 deposit match. Get in on this now before the 2023 24 season is in too deep. It's time to step up to the challenge on rival fantasy. See you in the arena. Alright. Since the the cover of this podcast was hyping Camilla and I talking about our 30 team league, which was poorly thought out by me, because there's so much other stuff to talk about. Nobody cares about"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_108",
    "data": {
      "text": "was poorly thought out by me, because there's so much other stuff to talk about. Nobody cares about my 30 team draft at this point. I wouldn't think, but I will say that I am destroying my 2 opponents right now. I'm up 7 to 2 in both games. One of them is my coworker over at ESPN, professor professor Dre. The lineup I played this week is actually not the right one because I screwed up, but, so a 30 team draft. I am starting De'Aaron Fox, Kobe White, my guy, Jalen Hardy, did he even he didn't"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_109",
    "data": {
      "text": "a 30 team draft. I am starting De'Aaron Fox, Kobe White, my guy, Jalen Hardy, did he even he didn't even come up in the game for the Mavericks last night, I don't think, Noah. So that was a set up. That was a huge mistake. And he's coming off an injury, and they said he was available. He didn't even play. Meanwhile, Cam Thomas Cam Thomas is on my bench. They had him as a questionable coming into it. I remember they had him and Luca and Dwight Powell as questionable. So they were all playing,"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_110",
    "data": {
      "text": "it. I remember they had him and Luca and Dwight Powell as questionable. So they were all playing, and now I'm looking at it, and it's saying Jaden Hardy and Dwight Powell didn't play because of an illness. So I remember them getting cleared. Oh, maybe maybe he was sick. So I guess they cleared them and then didn't play them and said, oh, yeah. Actually, they're sick, which is really cool. So I've got Darren Fox, Kobe YJ Nahari, Austin Reeves, Victor Waminama, Robert Covington, who started last"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_111",
    "data": {
      "text": "got Darren Fox, Kobe YJ Nahari, Austin Reeves, Victor Waminama, Robert Covington, who started last night. I think you were talking about him last week, Noah, and I was like, oh, I'm not falling for this Covington stuff, and then I drafted him in 30 deep, and started him. I've got Zach Collins. I've also got Sethi Osman, who we did not talk about, who actually played pretty well off the Spurs bench as he'll do. But as has been heavily documented documented by me over the years, the Chetty pill"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_112",
    "data": {
      "text": "as he'll do. But as has been heavily documented documented by me over the years, the Chetty pill is a tough one to swallow. I do have Cam Thomas on my bench. I have Payton Pritchard there. But even with the mistake on Cam Thomas, I'm I'm rolling through this league right now. Hey. We didn't mention Scoot Henderson. What did Scoot do last night? Slow first half ended up scoring 11 points. Wasn't great. I was just watching his shot attempts right before we started. A lot of his scoring was done"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_113",
    "data": {
      "text": "great. I was just watching his shot attempts right before we started. A lot of his scoring was done kind of in the Q4 on Bones Hyland, kinda after the game. Not was the game was over, but it was kinda later in the game. So it wasn't quite as flashy of a debut for him as it was for some of the other guys, but I'm not, too concerned about that. It was it was the Clippers. They're a tough team. Alright. And then Kamala is 6 and 2 and 1 in each of his two games in 30 deep. He's got Dame Lillard"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_114",
    "data": {
      "text": "And then Kamala is 6 and 2 and 1 in each of his two games in 30 deep. He's got Dame Lillard going tonight, so that's pretty huge. That's his that's his first pick. Had PJ Washington. Rudy Gobert, who we didn't mention, looked really good. He looked good stat wise for Minnesota last night, but he didn't play very well. Him and Kat are funky together. Like, it still it still doesn't seem like seem like it's right. Anyway, there's there's some 30 deep chatter we got. We got it in. We contractually"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_115",
    "data": {
      "text": "it's right. Anyway, there's there's some 30 deep chatter we got. We got it in. We contractually took care of our obligations there. There we go. No. You got anything else to add? Just excited basketball's back. I've been just reading through all the, the box scores to try and see what I should watch and just a lot of weird numbers. You know? Like, because I was starting a little bit of a Twitter thread before we started this, and I'm gonna finish it up after. 5 3 players had 5 blocks last"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_116",
    "data": {
      "text": "thread before we started this, and I'm gonna finish it up after. 5 3 players had 5 blocks last night. 5 players had 4, and 6 had 3 blocks. It's just it was crazy. Like, Anthony like, then the, the Timberwolves, Anthony Edwards, Rudy Gobert, and Cat all had double digit rebounds, and Cat and Gobert had 4 blocks. I'm just excited for basketball to be back, and all these numbers seem a lot of fun. Great for Fantasy basketball. Yeah. It it was it was pretty fun, and, Jared Jackson junior had a lot"
    }
  },
  {
    "id": "opening_week_fantasy_takeaways_30team_draft_review_117",
    "data": {
      "text": "for Fantasy basketball. Yeah. It it was it was pretty fun, and, Jared Jackson junior had a lot of those blocks you're talking about as well. Yep. Alright. I'm doctor a. He's Noah Rubin. I'll be back on Tuesday with the voice of the hawks, Bob Rathman, at 11 AM right here on the RotoWire Fantasy Hoops podcast. Thanks for watching."
    }
  }
]