[
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_1",
    "data": {
      "text": "Welcome to a regular season edition, Brandon Kravitz, of the rotor wire fantasy basketball podcast. I am Nick Whalen joined as I always am on Wednesdays. It will be throughout the NBA season by Brandon Kravitz. Brandon, had a lot of fun previewing the season these last few weeks with you, but, man, it is great to have real NBA basketball back. You know, like, the 1st week of the preseason, I've dialed in. I'm watching every game. I'm watching the condensed highlights, things like that. But by"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_2",
    "data": {
      "text": "dialed in. I'm watching every game. I'm watching the condensed highlights, things like that. But by the end of the preseason, you're just kinda ready for things to to have real meaning. And what a relief it was last night to to get Lakers nuggets in the early window and then, really fun game, a little bit of a sloppy game. Really, both of them were a bit sloppy between the Phoenix Suns and the Golden State Warriors. But let's start with the LA Lakers. You know, there's a a big outbreak of panic"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_3",
    "data": {
      "text": "State Warriors. But let's start with the LA Lakers. You know, there's a a big outbreak of panic on fantasy basketball Twitter after this game when Darvin Ham said, yeah. You know, we we've kinda want to to to have this plan in place for LeBron James to to have a limited workload during the regular season. He played 29 minutes last night, was notably, like, in and out of the game in in short stints. You know, didn't play a ton, in the first half, especially. And even as the lakers were making a"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_4",
    "data": {
      "text": "You know, didn't play a ton, in the first half, especially. And even as the lakers were making a rally, you know, it felt like they were pretty hard line sticking to this stance that LeBron James was not going to play 30 minutes no matter what. Still gives you 21, 8, and 5 with a steal, 10 of 16 from the field. I thought he looked great physically. I will say this. I I don't think LeBron James is going to average under 30 minutes this season. This is like the 8th year in a row that whatever"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_5",
    "data": {
      "text": "is going to average under 30 minutes this season. This is like the 8th year in a row that whatever team he's on has said that they're managing his workload. But as we saw last night, when LeBron's off the floor, the Lakers are not gonna win a lot of games. No. And as somebody who had, Lakers plus 5 quite confidently last night, every time they took him out, I was just cringing because this Lakers team would allow the Nuggets to just pour it on. And you see it reflected in the in the box score,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_6",
    "data": {
      "text": "team would allow the Nuggets to just pour it on. And you see it reflected in the in the box score, LeBron James plus 7. I don't think anybody else was, was in plus territory How about you? Terms of the starters. I don't I you know, that's that might need to be debunked. That I mean, plus minus, take it for what it's worth. But I think for LeBron, it does tell a story here. Yeah. I agree. He looked really good. That was great to see. He doesn't look like a 38 year old. I don't think that shocks"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_7",
    "data": {
      "text": "really good. That was great to see. He doesn't look like a 38 year old. I don't think that shocks anybody at this point because he's he is so great that he defies reality. But he's still somebody that's inching closer to 40 years old, so it's probably the right approach. But how long can you get away with it? The good news is the Lakers won't be playing the defending champions every single night. And, man, credit where credit is due. Denver picked up right where they left off. You know, part of"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_8",
    "data": {
      "text": "And, man, credit where credit is due. Denver picked up right where they left off. You know, part of my handicap last night, and I know we didn't have an episode where I you know, thankfully, you guys didn't hear this because maybe I would have convinced some people to lose money with me. You figure there's gonna be some form of a championship hangover. You know, Jokic couldn't go back home and ride horses fast enough if you're playing all that basketball last year, and they just didn't miss a"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_9",
    "data": {
      "text": "horses fast enough if you're playing all that basketball last year, and they just didn't miss a beat. It was like they were playing the next game of the NBA final series. That's how locked in and and prepared they looked. I thought the Nuggets role players vastly outplayed the Lakers role players for most of the night. You know, KCP was one of the best players on the floor for either side. He goes 8 of 12, 2 of 3 from beyond the arc. Aaron Gordon, looked really good, had some big shots"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_10",
    "data": {
      "text": "He goes 8 of 12, 2 of 3 from beyond the arc. Aaron Gordon, looked really good, had some big shots throughout this game. Obviously, Jokic and and Jabal Murray did what they do. I mean, Jokic was just, you know, the the touch around the rim. I mean, that's that's the thing that I always come back to with him. It's like the the angles don't matter. The the level of defense doesn't seem to matter. As long as he could get that shot off and he's within 5 feet, it always finds a way to kinda die on"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_11",
    "data": {
      "text": "As long as he could get that shot off and he's within 5 feet, it always finds a way to kinda die on the rim and just roll in. I mean, he's Just it looks so easy for him. He's doing it he was operating at, like, 75% speed, which I I know he always is to some degree. But, like, I I you know, Denver played well. They they shot 53% from the field. A lot of it was shot making. You know, it felt like the Lakers were missing a lot of the looks that that Denver was making. It was not a good night for"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_12",
    "data": {
      "text": "the Lakers were missing a lot of the looks that that Denver was making. It was not a good night for Austin Reeves. Was, you know, D'Angelo Russell, we said he was a plus one, but he's just he's not a winning player. And I I don't think he's long for this Lakers team. I'd be shocked if he makes it through the regular season as a member of this team. Tory and Prince, you know, if we're talking guys to to maybe take a look at, off the waiver wire, we'll see how much time Jared Vanderbilt misses,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_13",
    "data": {
      "text": "to to maybe take a look at, off the waiver wire, we'll see how much time Jared Vanderbilt misses, but he hit 4 3 pointers, 18 points, 3 boards for him at a block as well. We need to talk about Anthony Davis, Fred, and I I took him in the 1st round of my NFBKC the other night. I didn't feel great about it. You're never gonna feel good about your entire fantasy basketball season hinging on Anthony Davis, but, you know, my my concern, of course, is that he's not going to play more than, like, 55"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_14",
    "data": {
      "text": "Davis, but, you know, my my concern, of course, is that he's not going to play more than, like, 55 games. It's it's not that he's going to go scoreless in the second half of a huge game when, you know, he he talked all all off season about how he can't wait to play the Nuggets, and then he comes out and just has a a classic Anthony Davis, I'm not that guy type of performance. Exactly. Because it's not like he wasn't involved. He was o for 6 from the field, so he was he was getting shots up."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_15",
    "data": {
      "text": "it's not like he wasn't involved. He was o for 6 from the field, so he was he was getting shots up. They weren't going in. He is. He is the most befuddling player in the NBA because at his best, he's a top five guy, but you can't have a conversation about him in that range because he has these disappearing acts. Usually, it's not in the middle of the game. I feel like that's not really Yeah. How Anthony Davis usually usually, he starts the game and you know he's gonna be irrelevant all the way"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_16",
    "data": {
      "text": "Anthony Davis usually usually, he starts the game and you know he's gonna be irrelevant all the way through. Seventeen points in the first half. It was like, alright. This is an Anthony Davis game. I was feeling pretty good about my Lakers side because when he's playing at his best, that's when the Lakers win games. LeBron's always gonna give you that sort of consistency. The fact that he didn't play over 30 minutes, and then you had a no show from Anthony Davis in the second half. In some"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_17",
    "data": {
      "text": "play over 30 minutes, and then you had a no show from Anthony Davis in the second half. In some ways, it's surprising it's as close as it was at the end of the night. But, yeah, that's it's really disappointing. I, you know, hate to be the guy that says I told you so. I don't touch Anthony Davis because I don't trust him. I was picking 9th overall. You know, it's kinda at that point where if you're not taking him, you're reaching it felt like for some guys who you'd rather take in in round 2."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_18",
    "data": {
      "text": "not taking him, you're reaching it felt like for some guys who you'd rather take in in round 2. And I I was able to pair him with LaMelo Ball, who is still on the board coming back around. Well, that's like the all can't trust you, duo. I know. I was like, well, I might as well might as well lean into it at this point. So, yeah, I I'm either winning $10,000 or I'm taking dead last most likely in that league. That's That's the one where you owe people steak, is it? No. Thank God. No. Okay. I do"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_19",
    "data": {
      "text": "that league. That's That's the one where you owe people steak, is it? No. Thank God. No. Okay. I do not have him. That one that one's at auction. So, like, you have to go out of your way to end up with Anthony Davis in that league. And I I think I had him last year, actually. So we will not be we'll not be going down that path, again, but we'll we'll provide updates on that league as the year goes along. You know, we saw a decent amount of Cam Reddish. 18 minutes, looked okay. He was actually a"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_20",
    "data": {
      "text": "along. You know, we saw a decent amount of Cam Reddish. 18 minutes, looked okay. He was actually a plus for the Lakers. I I I think those minutes probably evaporate, to a significant degree with Jared Vanderbilt is back. Gabe Vincent did not look good. My goodness. I mean, he was he was probably the the biggest minus, I think of all the role players for the Lakers, even more so than D'Angelo. Russell just getting hunted on defense. You know, wasn't hitting anything. He's o for 4 from 3. You"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_21",
    "data": {
      "text": "Russell just getting hunted on defense. You know, wasn't hitting anything. He's o for 4 from 3. You know, again, not not a ton to take away fantasy wise, like Rui Hashimura, 3 of 10. That's just kinda what Rui Hashimura does. Like, I'm not I I I I I I I I think the collective depth that the lakers have, Brandon, but I I'm not really high on any of these guys individually. Like, even as, like, late round fantasy targets. Like, I've never been a hatchimera guy. You know, Christian Wood had a"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_22",
    "data": {
      "text": "late round fantasy targets. Like, I've never been a hatchimera guy. You know, Christian Wood had a couple nice looks, last night, but I I think when Vanderbilt's back, his minutes kinda dry up as well. Is there anything else you wanna mention from Lakers Nuggets? Yeah. I actually have have been a little bit higher throughout the draft process on some of these Lakers bench guys. I I love Rui Hashimura. I think that he will get rolling at some point this season. Just the way the Lakers play"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_23",
    "data": {
      "text": "Hashimura. I think that he will get rolling at some point this season. Just the way the Lakers play basketball is, LeBron super light. But I'm not comparing the 2 by any means. I'm not comparing. I'm just I'm saying in terms of the the the body size, the ability to get to the rim, the comparisons end there, but I feel like He's Marcus Morris super light. He's super what are we talking about? LeBron? Goodness. Super super duper I can't add enough. I would it would take up the rest of the episode"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_24",
    "data": {
      "text": "Goodness. Super super duper I can't add enough. I would it would take up the rest of the episode for me to hit you with that. But I know. I can't add enough. Terms of look. This is a team that wants to beat you with their size. He's got it. That's that's the point. Technically, he does. Yeah. You're not wrong. He's a big body. He's a big body that can get to the rim, and he's had he's had his stretches. I thought he got lost in Washington as most players do, and he's played well for LA. This"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_25",
    "data": {
      "text": "I thought he got lost in Washington as most players do, and he's played well for LA. This is, but he gives you these stinkers. So, I didn't end up with him anywhere, so not as not exactly a money where my mouth is situation. Christian Wood is somebody that I have rostered, and I don't think I'm gonna be able to drop him fast enough. He's bad. It's yeah. Just I I've been overrating him for years, and it's kind of I'm at the point where it's just time to admit it. The Gabe Vincent thing, I'm very"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_26",
    "data": {
      "text": "it's kind of I'm at the point where it's just time to admit it. The Gabe Vincent thing, I'm very curious to follow this. It's one game. You're not gonna make too much of it. He's not gonna go over from 3 point range all season long, but if he is bad for this Lakers team, boy, is that gonna just shine a big bright light on hashtag heat culture like never before because he was a playoff superstar. Yeah. I mean, it would be shocking to me if he takes a step back. Like, there's there's something"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_27",
    "data": {
      "text": "Yeah. I mean, it would be shocking to me if he takes a step back. Like, there's there's something about that that heat team where it's like everybody felt like was playing above their level. Right? Like, I wouldn't be surprised if we see kind of a similar thing with Baxter's in Cleveland where he's just not quite not quite as good. Like, there's there's something about playing in Miami and and kind of the the coalescence of how that group came together that it's gonna be hard to replicate"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_28",
    "data": {
      "text": "kind of the the coalescence of how that group came together that it's gonna be hard to replicate somewhere else. Yeah. I don't have much else on this game. You know, we handed out a few props on the rotor wire NBA show on SiriusXM last night. You know, Alex hit his best bet. KCP over 1 and a half threes. I hit mine, which was Anthony Davis to just make 13. Luckily, we got that out of the way early. I thought he would take, like, 5 or 6. He'd been launching a bunch of threes in the preseason."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_29",
    "data": {
      "text": "I thought he would take, like, 5 or 6. He'd been launching a bunch of threes in the preseason. Darvin Ham said he wants Anthony Davis taking, like, 6, 7, 3 pointers per game. He was aggressive early on, completely got away from that as the game went along. But that is something, you know, fantasy wise to keep an eye on when it comes to Anthony Davis is that at least a theory, you know, that that 3 point production could tick up a little bit, but we'll see how comfortable he ends up being."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_30",
    "data": {
      "text": "that 3 point production could tick up a little bit, but we'll see how comfortable he ends up being. Alright. Before we talk Warrior Sons, Brandon, let's let's touch on this James Harden situation because I I'm getting tweet alerts, like, every 5 minutes from Chris Haynes. You know, 22 minutes ago, James Harden was expected to travel with the 70 sixers today to Milwaukee. They're coming here. They're they're coming to, you know, my town to play the bucks tomorrow night. And then roughly 14"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_31",
    "data": {
      "text": "They're they're coming to, you know, my town to play the bucks tomorrow night. And then roughly 14 minutes after that, Chris Haines' tweets update. James Harden will not travel with the team to Milwaukee today. It will remain in Philadelphia to continue his ramp up. You know, Harden said, like, a month ago that he wanted to, you know, be around the team, but make things uncomfortable, try to force his way out. I are are the sixers uncomfortable here? Like, if anything, this just feels like one"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_32",
    "data": {
      "text": "his way out. I are are the sixers uncomfortable here? Like, if anything, this just feels like one giant inconvenience, and I I I don't think anybody is, like, feeling bad for James Harden. Yeah. Well, if I hear a player say, I wanna play, I wanna be around, but I'm gonna make the team uncomfortable, I'm not exactly saving a spot on the airplane for that individual. I think the sixers are making the right choice here. I thought that James Harden would be dealt by now, but Daryl Morey,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_33",
    "data": {
      "text": "making the right choice here. I thought that James Harden would be dealt by now, but Daryl Morey, understandably so, doesn't wanna operate in, in panic mode. That's not what good general managers do. But, when you see a report like this ahead of game 1 where you're trying to set the tone for the season, this is a sixers team that has high aspirations. If if he doesn't play and not traveling with the team, what's to make you believe that he's ever gonna suit up for the Philadelphia 70 sixers"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_34",
    "data": {
      "text": "the team, what's to make you believe that he's ever gonna suit up for the Philadelphia 70 sixers again? So, this is, we're just sort of waiting. It's an if, it's a it's a win, not if situation at this point. Yeah. I mean, there's kind of this lingering deadline of, like, you know, if hardens away from the team for, what, 30 days, you know, then he could potentially lose his ability to become a free agent. But I honestly, I gotta do more reading on that. Like, is is does he have to play in"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_35",
    "data": {
      "text": "a free agent. But I honestly, I gotta do more reading on that. Like, is is does he have to play in games? Can he just can he be with the team? Does that, you know, extend that timeline? I'm really not sure. I mean, I I do think it's it's still overwhelmingly likely that he's traded at some point. You know, ironically, Terrence Mann, is on the entry report and will not play tonight. I I think there was some speculation, you know, around NBA Twitter over what that could mean, but, I I do think at"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_36",
    "data": {
      "text": "was some speculation, you know, around NBA Twitter over what that could mean, but, I I do think at some point, he gets his wish and and is likely traded to the Clippers. But Daryl Morey is not just gonna send him out for 40¢ on the dollar. Like, I I think they're gonna have to get another team involved. They're they're gonna try to create you know, manufacture some sort of minor bidding war for James Harden because I I don't think they're just gonna, you know, basically send them over to the"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_37",
    "data": {
      "text": "James Harden because I I don't think they're just gonna, you know, basically send them over to the Clippers for free. But, nonetheless, at this point, looks very unlikely that James Harden is going to play on opening night. So as of now, you know, if you're if you're kinda configuring your your weekly lineup ahead of a 12 game slate on Wednesday, I would be leaving James Harden out of that. Bucks, by the way, either 5 and a half or 6 point favorites at home over the sixers depending on where"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_38",
    "data": {
      "text": "by the way, either 5 and a half or 6 point favorites at home over the sixers depending on where you look. I think I like that. I think so too. I I think so too. I you know, it's funny. I've seen a lot of, like, projection models, you know, that that kind of spit out wind totals and things like that. A lot of those are low on Milwaukee. I I think there's some concerns about the the lack of proven depth and, you know, the potential fall off on defense going from Drew to Damian Lillard. I I get"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_39",
    "data": {
      "text": "depth and, you know, the potential fall off on defense going from Drew to Damian Lillard. I I get it. I I don't I don't think they're gonna be a team that's, like, pushing for 60 wins or anything. I think they'll they'll go through some ups and downs. I wouldn't be surprised if it's a little rocky at first, but I was looking at one of them. I I forget what which system it like, the Darko system, I wanna say, had the Bucks pegged for, like, 44 wins. Like, come on. They'd have to have some"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_40",
    "data": {
      "text": "I wanna say, had the Bucks pegged for, like, 44 wins. Like, come on. They'd have to have some serious injury problems to get the Yeah. Which is possible. For 44. Yeah. I if you have 44 wins is we we it'll be, it'll it'll be like, the ship is sinking situation by the end of the year. Yeah. Yeah. Well, the one thing I do worry about, you know, I I think Giannis, Lillard, both of those guys, you know, they they probably build in some rest, but, you know, neither of them have, like, a real injury"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_41",
    "data": {
      "text": "they they probably build in some rest, but, you know, neither of them have, like, a real injury track record. I I do feel like what's going a little undercover is, you know, Brook Lopez at, what, 35, 36 years old coming off a back surgery 2 years ago. He played, I I think, 77 games last year. I mean, that is best best best case. And, you know, I think if if Brook Lopez were to, you know, have anything happen with that back again and and miss any chunks of time, like, that that to me is where"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_42",
    "data": {
      "text": "happen with that back again and and miss any chunks of time, like, that that to me is where the Bucks could be in real trouble defensively. Yeah. I have the Bucks making it to the finals. So this, the conversation is not making not giving me the warms Mormon fuzzies in terms of that pick. Alright. Let's go to Suns Warriors. We'll completely flip it. Well, no more injury talk here. Although, no Draymond Green for Golden State. No Bradley Beal for the Phoenix Suns. They they said during the"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_43",
    "data": {
      "text": "no Draymond Green for Golden State. No Bradley Beal for the Phoenix Suns. They they said during the telecast that Beal was reportedly, quote, devastated, that he was unable to play on opening night, but he does hope to be out there. Suns play they turn around and play tomorrow at the lakers, in game 2 for both of those teams. Could be looking at an o and 2 start here for the lakers. Honestly, I feel like that's likely, based on how they looked last night, but, we will see 108, 104 in favor of"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_44",
    "data": {
      "text": "feel like that's likely, based on how they looked last night, but, we will see 108, 104 in favor of the Phoenix Suns. You know, kind of an ugly game on the Golden State side. You know, they were kinda on the verge of of getting blown out. I mean, they were down 15 at the half. You know, came out with a with a vengeance in the 3rd quarter. They outscore Phoenix 40 to 19 in the 3rd period, end up leading the game going into the 4th, and that Phoenix rallies back. So it was you know, everybody"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_45",
    "data": {
      "text": "leading the game going into the 4th, and that Phoenix rallies back. So it was you know, everybody says the NBA is a game of runs. Like, this was this was the single game sample where it just felt like each team was was kinda taking turns going on a run. Yeah. Well, first of all, how about that, Adam Silver? You put in those new rules about load management. Phoenix doesn't make it one game into the season. They're already load managing Bradley Beal. It's just comical. I do not like seeing that"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_46",
    "data": {
      "text": "season. They're already load managing Bradley Beal. It's just comical. I do not like seeing that right out of the gate. You gotta get these guys playing together. This team has very real title hopes, and if it's only one game, but you gotta you gotta start forming that chemistry. So the fact that they're already holding them out for cautious reasons, we had an entire off season. What are you worried about? Anyway, the warriors continue to be the best 3rd quarter team in NBA history, I think. 40"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_47",
    "data": {
      "text": "about? Anyway, the warriors continue to be the best 3rd quarter team in NBA history, I think. 40 to 19, it was about the only thing they did well, last night. I thought Phoenix looked really good. Kevin Durant didn't even really shoot the ball all that well. 7 of 22, Grayson Allen gave you nothing literally. 06 from the field last night. I thought Yousef Nurkic was I thought he really was the story for me because he proved in one night that he is such a better fit for this team right now than"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_48",
    "data": {
      "text": "for me because he proved in one night that he is such a better fit for this team right now than Deandre Ayton is. Fourteen points, 14 rebounds, 3 assists. He is just perfect for this roster, allowing everybody else to thrive, and he just takes easy buckets and gets rebounds. So this is a dangerous team. I I mean, I like Phoenix. As long as they can get over this paranoia of injury throughout the course of the season, this team's gonna be really good. Yeah. I like what I saw for Phoenix. I mean,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_49",
    "data": {
      "text": "of the season, this team's gonna be really good. Yeah. I like what I saw for Phoenix. I mean, they they started Josh Okogi, and we'll we'll see, you know, if that's ultimately his spot or if that's Beal's spot, or I should say Grayson Allen's spot. Obviously, Beal will be starting, you know, at one one guard spot. But I I I think they'll probably bring Grayson Allen off the bench. Like, that was the way it was reported going into last night was that Grayson Allen would start in place of Bradley"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_50",
    "data": {
      "text": "way it was reported going into last night was that Grayson Allen would start in place of Bradley Beal. So I I think they wanted Kogi out there for his defense, but he was great, you know, finishing around the rim, 7 of 9 from the field. Like you said, Durant, not a great night for him. You know, he's you know, even on a bad night, he's still gonna give you 18 and 11. Like, you're you're never gonna come away feeling like you just got completely burned by Kevin Durant, but he he didn't look"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_51",
    "data": {
      "text": "gonna come away feeling like you just got completely burned by Kevin Durant, but he he didn't look great. Devin Booker looked fantastic. He came out strong in this game. You know, he's kind of the finisher for the Suns. Like, they they they needed a basket late to to essentially, you know, put this one away, make it a 2 possession game. Booker held the ball for, like, I don't know, 18 seconds while being closely guarded. Like, 5 seconds just doesn't get called anymore. Maybe that's been"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_52",
    "data": {
      "text": "while being closely guarded. Like, 5 seconds just doesn't get called anymore. Maybe that's been completely erased from the rule book, but, did a really good job, you know, kind of protecting the ball from Gary Payton. Got into the rim or got into the paint, I should say, pulled up and then made a really nice last second pass to a cutting Nurkic, who laid it in to to put this game away. I I still think, like, if you just look at the basketball players, I think Deandre Ayton is is, like, a better"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_53",
    "data": {
      "text": "like, if you just look at the basketball players, I think Deandre Ayton is is, like, a better fit for the Suns, but I also think he he had basically just decided that he couldn't play there anymore. And I think Devin Booker had also decided that. So, you know, even though I I think going from Ayton to Booker or Ayton to Nurkic is, like, kind of a downgrade in terms of assets, I don't think the Suns really had a choice. I think they just had to get him out of there. And, you know, bringing in"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_54",
    "data": {
      "text": "Suns really had a choice. I think they just had to get him out of there. And, you know, bringing in Nurkic is kinda your emergency option. It it looks pretty good. It looks pretty good right now. I I I think I think defensively, there's some matchups where he's going to struggle, but, I mean, his finishing, you you kinda forget, like, when he's healthy, he's he's a skilled skilled player. He's a better passer than Deandre Ayton. You know, it's injuries have really been the thing that I I feel"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_55",
    "data": {
      "text": "better passer than Deandre Ayton. You know, it's injuries have really been the thing that I I feel like has kinda knocked his reputation the last few years. Yeah. The thing I like about it is that it yeah. It's a downgrade. It's not like he's a better player than Deandre Ayton. I think he's a better fit for this roster because with the 3 guys that are gonna be handling the ball and scoring most of the buckets throughout the course of the season, Beal didn't play, but we still saw that from"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_56",
    "data": {
      "text": "of the buckets throughout the course of the season, Beal didn't play, but we still saw that from Durant and Booker in this game. Guys like Nurkic and Ayton when he was there, they're gonna fade into the background. Nurkic isn't bothered by that. He's not gonna lose focus because he's not involved. Deandre Ayton would if you didn't if you didn't get him involved early, he would lose him in a basketball game. And and I just think that that's not what you need if you're the Phoenix Suns. So this"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_57",
    "data": {
      "text": "game. And and I just think that that's not what you need if you're the Phoenix Suns. So this this Nurkic ad, it seems to be paying off early. One of the things that I'd take away from last night is you you go into the chase in into the, Chase Center. Is it Chase Center? Chase Arena? I think Chase Center. Yeah. Okay. And you you held the warriors to 104. You won the game without getting into a shootout with this basketball team. Mhmm. We don't look at the Suns and say they're gonna beat you with"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_58",
    "data": {
      "text": "with this basketball team. Mhmm. We don't look at the Suns and say they're gonna beat you with their defense, but the team actually played pretty well defensively. That's that's gotta be something they're gonna hang their hat on after last night. Yeah. Yeah. They did. And, you know, I I think they have done a good job of mixing in, you know, at at some of these role player spots, mixing in defensive focus players. Right? I mean, even someone like Nas Little who barely played in this game, but,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_59",
    "data": {
      "text": "focus players. Right? I mean, even someone like Nas Little who barely played in this game, but, you know, had played a couple key minutes late. You know, Kogi, I think, is number 1 on that list. And the Suns bench is a little alarming, and we we could kinda say the same thing about some of the pieces that the warriors were bringing off the bench as well. But, I mean, it's Eubanks, Watanabe, Little, Gordon, Jordan Goodwin. I mean, those that that's your bench unit. And, you know, there's"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_60",
    "data": {
      "text": "Little, Gordon, Jordan Goodwin. I mean, those that that's your bench unit. And, you know, there's obviously, when Bradley Beal plays, you know, maybe you you drop one of those guys, but still, I mean, this is a team that's going to be hunting, I think, for help, at the deadline, you know, whether it's a buyout player or, you know, some sort of minor trade at some point because it's it's about as top heavy of a roster as we've seen, with that big 3. The warriors I would not don't sleep on their"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_61",
    "data": {
      "text": "top heavy of a roster as we've seen, with that big 3. The warriors I would not don't sleep on their depth. The fact that my guy, Bowl Bowl, was, a DMP coach's decision speaks to how loaded they are. Yeah. He he must still be ramping up, I think to to give you a sense here. Yeah. Well, they can it was Kendrick Perkins that said that he could win defensive player of the year, which might have been those were actual word his words. I don't know what NBA he is watching, but, but, yeah, Bow Bowl"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_62",
    "data": {
      "text": "those were actual word his words. I don't know what NBA he is watching, but, but, yeah, Bow Bowl didn't get in there last night. The depth when you get to the playoffs, though, which this team is built for, how much does depth really matter when you're that loaded in in terms of your starting lineup? These guys are gonna play such heavy minutes at that point. So as long as you can get there, and they should be able to do that. You wanna talk about how bad Chris Paul was to open the game last"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_63",
    "data": {
      "text": "they should be able to do that. You wanna talk about how bad Chris Paul was to open the game last night? Yeah. We we can. I mean, I agree on the minutes that are on the the depth thing to some degree, but I also don't think you want Kevin Durant playing, like, 42 minutes a night in the 1st round of the playoffs. Right? I I think there's a wear and tear factor that the further you advance, you're you're just you're asking more and more of those guys because you're you're not adding any depth as"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_64",
    "data": {
      "text": "you're just you're asking more and more of those guys because you're you're not adding any depth as the playoffs go along. Yeah. Chris Paul, I mean, Paul had a I think it was in the Q3. You had a nice little run where you you, you know, got an add one off of off of Nurkic. You know, looked like he was turning things around, but started o of 6 from the field, ended up, 4 of 15. It was not a not a banner night shooting the ball for the Golden State Warriors. Like, I I think you do give credit to"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_65",
    "data": {
      "text": "banner night shooting the ball for the Golden State Warriors. Like, I I think you do give credit to Phoenix defensively. Only forced 11 turnovers. Phoenix actually had 19 of their own, but a lot of this was the warriors just missing missing the type of 3 pointers that we're used to them making. And, you know, Paul, o for 6 from 3. Wiggins, o for 3. Even Steph Curry, 4 of 14, and then, was not a banner night for Klay Thompson either. He went 3 of 11. Yeah. I just don't I don't think you need"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_66",
    "data": {
      "text": "a banner night for Klay Thompson either. He went 3 of 11. Yeah. I just don't I don't think you need Chris Paul taking 6 threes per game so that I mean, he's not gonna miss all of them obviously in the future, but that's that's not really what he's there for. They have guys to do that. They still went cold, pretty much everywhere else. Credit the Suns and what they were able to do defensively, but, yeah, this just wasn't a great night. It wasn't a great showcase for Klay Thompson who's still"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_67",
    "data": {
      "text": "but, yeah, this just wasn't a great night. It wasn't a great showcase for Klay Thompson who's still looking for an extension to start the, the year with 15 points when you you and Curry need to be the offense at this point for this team as they've always been. This isn't anything new. These guys are getting older, and this is the concern with the Golden State Warriors. I'd certainly respect NBA history. I respect the legends that these guys have turned themselves into, but this is why I don't"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_68",
    "data": {
      "text": "history. I respect the legends that these guys have turned themselves into, but this is why I don't have the warriors going all that far in the playoffs this year. I think this team is gonna look old, more times than not in key moments. We saw a lot of Dario Saric last night. Probably more Dario Saric than we needed to. But but that, again, speaks to some of the depth issues that the warriors have. And, look, with Draymond's in there, Saric is probably playing, you know, 8 to 10 minutes instead"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_69",
    "data": {
      "text": "And, look, with Draymond's in there, Saric is probably playing, you know, 8 to 10 minutes instead of 20 minutes. But, you know, their bench unit we we could kinda joke about Phoenix's, but Sarge, Kuminga, Corey Joseph, Gary Payton, Moses Moody. You know, I thought Moody and Kuminga, you know, gave the warriors some good minutes, especially during that Q3 run. You know, I'm I'm still pretty high on on what Kuminga can be. He had, you know, 2 steals and a block, for fantasy purposes, but, I I"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_70",
    "data": {
      "text": "on on what Kuminga can be. He had, you know, 2 steals and a block, for fantasy purposes, but, I I think the warriors are another team that, you know, they're kinda gonna assess where they are midseason, and, you know, they you talk about them getting older. Like, they're they're leaning into that. Right? Like, they for a while, they were kinda trying to play both sides and, like, develop this this kind of next generation core for their franchise. They're still doing that to some degree with"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_71",
    "data": {
      "text": "this kind of next generation core for their franchise. They're still doing that to some degree with Kuminga and Moody, but, you know, that now they've kinda leaned the other way bringing in Chris Paul. Like, the the old get older. Well yeah. Because they realized that the next they were trying to play both sides like you said that, but they realized that their next generation guys weren't really all that good. That's why they got rid of James Wiseman. Kuminga has not developed yet. Moody shows"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_72",
    "data": {
      "text": "all that good. That's why they got rid of James Wiseman. Kuminga has not developed yet. Moody shows moments. I really liked him coming out of college, but he hasn't shown that he can be that guy to take the mantle. They wanna pass the baton, but those guys are not ready to carry it. So they wanna be younger. They've wanted that for the last couple of years. They have not been able to make that transition, so they have to lean on age and and these veterans. At some point, the well is gonna run"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_73",
    "data": {
      "text": "so they have to lean on age and and these veterans. At some point, the well is gonna run dry. Steph Curry is still amazing. The guy can't do it all by himself, and defensively, he's never been able to do it all by himself because that's not his game. So where are they bringing it in terms of defense? And if the legs are getting old and tired, then you really where do you love the warriors anymore? It's a team that's chock full of names that might not be able to produce in a way that we're used"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_74",
    "data": {
      "text": "It's a team that's chock full of names that might not be able to produce in a way that we're used to. So how's that for a game one overreaction? Alright. The warriors are cooked. You heard it here first. Yep. I didn't grab it. That's right. Alright. Before we we turn our attention to Wednesday's monster slave, we got a question in the chat from our our good pal, Banana. He says, Brandon, thoughts on the lack of a true point guard in Phoenix. I I I think for fantasy purposes, this is actually"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_75",
    "data": {
      "text": "on the lack of a true point guard in Phoenix. I I I think for fantasy purposes, this is actually going to be a good thing for Devin Booker, specifically. You think back to, excuse me, you think back to a couple years ago when the Suns basically had no point guard. Yeah. This was before they they had arrived in our the sunset we think of today. Alright. Booker had, like, back to back years where he was essentially playing point guard on an experimental basis and an average to around 7 assists"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_76",
    "data": {
      "text": "he was essentially playing point guard on an experimental basis and an average to around 7 assists per game. So I I think between he, Durant, and Beal, I think Booker's the guy that's going to be on the ball the most. He had 8 assists last night. Of course, when Beal's back, you know, maybe it's more of a a split between those 2, but, I I don't see the Suns, like, bringing in anybody, you know, who who really functions as a true point guard. I think they're they're fine with 3 main guys"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_77",
    "data": {
      "text": "know, who who really functions as a true point guard. I think they're they're fine with 3 main guys splitting those responsibilities, and I I think Booker is the guy who's gonna benefit most in terms of fantasy. I'm gonna hit you with the cliche that you'll hear from coaches all year long. It's positionless basketball at its absolute finest. Yep. You've got 3 guys that are just gonna score a ton of points this year that all do pretty well in isolation. So if they're if they're running,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_78",
    "data": {
      "text": "a ton of points this year that all do pretty well in isolation. So if they're if they're running, everybody's viable. And then if they get stuck in the half court, they can put the ball in any of those 3 stars' hands, and they can and they can make, they can either create space for somebody else and and an easy outlet pass will get the job done, or they can just get a bucket themselves. So do they even need a point guard, I guess, would be my question. I don't think they do. I don't think they"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_79",
    "data": {
      "text": "even need a point guard, I guess, would be my question. I don't think they do. I don't think they do, and I think they would have addressed that if they believe they needed a point guard. I think you got 3 guys in in Durant, Booker, and Beal who, you know, for the most part, can can all handle the ball to to some degree. And I think I mean, Beal and Booker could play point guard if they wanted to. Right? Like, they're they're you think of those guys as kind of true classic shooting guards, but"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_80",
    "data": {
      "text": "Right? Like, they're they're you think of those guys as kind of true classic shooting guards, but I I think between those 2, they're they're plenty fine with what they have right now. We had another quick question here, Brandon. Thoughts on okay. We got a murders row here. Paul Reed, Kobe White, Xavier Tillman, Derek Lively, and Jeremy Sohan in roto, being asked to rank those players. I'll leave that one to you. Yeah. I I think I might go Tillman 1. Just I think he's gonna play a lot of"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_81",
    "data": {
      "text": "leave that one to you. Yeah. I I think I might go Tillman 1. Just I think he's gonna play a lot of minutes. Like, he was already playing amount of minutes last year. I I get the Kobe White hype. You know, obviously, he was a, you know, top 10 pick not that long ago. They they have this void at point guard. Paul Reed, we'll see. You know, kinda feels like he needs a an Embiid injury. The Sohan thing, I I think the percentages might hurt you. I mean, it's never a good thing when you're when"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_82",
    "data": {
      "text": "thing, I I think the percentages might hurt you. I mean, it's never a good thing when you're when there's, like, a story that comes out that you're being asked to shoot free throws one handed. You know, usually, like, the the 88% free throw shooters are are not being asked to do that. So I in Rodo, I I worked out though. He's got better when he went to the one hand. Yeah. Yeah. And, yeah, I mean, the fact that he's willing to do it, says a lot. I I think I would go Tillman, White, Lively,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_83",
    "data": {
      "text": "mean, the fact that he's willing to do it, says a lot. I I think I would go Tillman, White, Lively, Sohan, Reid. But, you know, ultimately, those are, you know, kinda end of the roster type of guys. We got some ads to pass along here before we talk about Wednesday's slate, and get into some of the players that are going to define our fantasy seasons. Underdog fantasy. Been working with underdog for a long time. Brandon and I both play a ton on underdog, both for their NBA and NFL contest. It is"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_84",
    "data": {
      "text": "a long time. Brandon and I both play a ton on underdog, both for their NBA and NFL contest. It is the number one platform for NBA best ball and DFS player pickup contest. If you have not tried underdog yet, new users receive a first time deposit bonus up to $500 and a free 6 month subscription to rotor wire. Just use the code RW NBA. That's RW NBA. Go to underdogfantasy.com or download their app today. And again, be sure to use that promo code RW NBA. That'll get you your free RotoWire"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_85",
    "data": {
      "text": "app today. And again, be sure to use that promo code RW NBA. That'll get you your free RotoWire subscription and that deposit bonus up to $500. Vivid Seats. The NBA season is here. And on behalf of our friends at Vivid Seats, let's get one thing clear. Nothing nothing beats seeing your favorite team crush it on the court to the sound of thousands of screaming fans. Every dunk, every dribble, and every heart pounding play from your favorite team live and in person. And because Vivid Seats is the"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_86",
    "data": {
      "text": "heart pounding play from your favorite team live and in person. And because Vivid Seats is the only ticketing company where you can earn rewards on every purchase, you could score amazing deals and unrivaled annual rewards all season long. Plus with a 100% buyer guarantee, you could be sure your ticket will be as legit as your love for the game. Visit vividseats.com or download their app today and use the promo code rotowire, r o t o w I r e, for $20 off your first $200 purchase. Again, that"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_87",
    "data": {
      "text": "and use the promo code rotowire, r o t o w I r e, for $20 off your first $200 purchase. Again, that promo code is rotawire for $20 off your first $200 ticket purchase. Download the app or visit vividseats.com. Vivid Seats, experience it live. Finally, new sponsor this week, rival fantasy. LeBron versus Jordan, Magic versus Bird, Barkley versus McHale. Basketball is synonymous with legendary player rivalries. They make the game more fun, and they give fans the storylines that raise the stakes"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_88",
    "data": {
      "text": "rivalries. They make the game more fun, and they give fans the storylines that raise the stakes every time those players meet on the court or come up in conversation. Now every player matchup in head to head debate can be settled on rival fantasy. This NBA season, you could play challenges where you decide which NBA player will score more fantasy points in their next game, play the rival fantasy in house challenges, or create your own and get a friend in the mix with customizable social"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_89",
    "data": {
      "text": "in house challenges, or create your own and get a friend in the mix with customizable social challenges. Sign up at joinrival.com/rotoWire. If you do that, you'll get a $200 deposit match. Get in on this right now before the 2023, 24 season tips off. It already has. So make sure you do that as soon as you can. It's time to step up to the challenge on rival fantasy. We will see you in the arena. Alright. That sounds like kind of a threat. I like that. We're raising the stakes here with rival"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_90",
    "data": {
      "text": "Alright. That sounds like kind of a threat. I like that. We're raising the stakes here with rival fantasy. Big slate I'm looking for you in the arena. I'll be I will I will have my eyes locked on the, on these stands. Great reads, by the way. Good job. Thank you. Thank you. I'm I'm very literate. A lot of people forget that. As I'm seeing a note here that Craig Counsell is interviewing for the Mets job. Don't love that. Anyway, that is neither here nor there as we are on a basketball podcast."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_91",
    "data": {
      "text": "job. Don't love that. Anyway, that is neither here nor there as we are on a basketball podcast. Not think we get a Craig Counsell reference on the NBA pod today. Oh, man. This this is people are gonna be upset about this in Milwaukee. Alright. So we we have another James Harden update. We it's it's been a combination of Chris Haines, Shams, and who are all just, like, chiming in and, like, one upping each other with news. Who is now reporting that James Harden has not actually practiced with"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_92",
    "data": {
      "text": "upping each other with news. Who is now reporting that James Harden has not actually practiced with the sixers in 10 days. It's been October 15th since his last practice. He's just kinda sounds like kinda getting work off to the side, working with their developmental coaches. The the plan is that he's going to ramp up in the coming days, but the sixers play their first two games on the road. They play Milwaukee, and then they're at Toronto. So what would you say in Harden is out at least the"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_93",
    "data": {
      "text": "play Milwaukee, and then they're at Toronto. So what would you say in Harden is out at least the first two games of the season? Yeah. No surprise here. I I think they're just they're gonna try and find a trade partner. If he hasn't been practicing, then, you know, you haven't earned your way onto the floor with these guys, and I'm not sure the players I would love to know their genuine feelings. Do they actually want to play with James Harden if they can't get a deal done immediately? So I I I"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_94",
    "data": {
      "text": "Do they actually want to play with James Harden if they can't get a deal done immediately? So I I I think a lot of this also has to come down to how much confidence do the sixers have in their ability to retain Joel Embiid because their path forward with Harden, they can be a lot more patient if they know that Embiid's gonna be out the door soon anyway. So if they're gonna have to trade him eventually, then who cares about keeping him happy? And let's just make sure we can maximize the return"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_95",
    "data": {
      "text": "then who cares about keeping him happy? And let's just make sure we can maximize the return for both of these guys. If you wanna keep Embiid happy and you wanna actually, get off to a good start this season and and not have a headache and your your top star disgruntled, you're gonna have to move off of James Harden quickly. So how they handle this is, I think, a pretty good tell of of how they view their relationship with Embiid. Yeah. We'll keep you posted, you know, over the rest of the pod"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_96",
    "data": {
      "text": "their relationship with Embiid. Yeah. We'll keep you posted, you know, over the rest of the pod if if any more news breaks on James Harden. But, again, for fantasy purposes, get him out of the lineup. Sounds like he's not going to play in the Sixers first two games. Brandon, you you texted me this morning, and, you know, you said you you wanted to talk about some kind of situational strategy when it comes to, you know, NBA bets, whether those are team or or player focused. So, I will give you"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_97",
    "data": {
      "text": "it comes to, you know, NBA bets, whether those are team or or player focused. So, I will give you the floor now. You know, we we have a a big betting slate to break down. We're not gonna go game by game or anything here since we got 12 games, but, you know, talk about some of these these, you know, situations that you're looking at, when you're looking for, you know, kind of pairing down a slate like this to find games or props to target. So for and this isn't I have I have 5 typical"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_98",
    "data": {
      "text": "a slate like this to find games or props to target. So for and this isn't I have I have 5 typical situational spots that I look for, and and none of it is, you know, that I follow like it's the bible in terms of, everything is is case by case. But there are 5 situations that I target throughout the course of the season that that have been pretty profitable for me. In terms of night 1, none of them apply because a lot of these deal with the ebbs and flows of an NBA season. For tonight, I think"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_99",
    "data": {
      "text": "apply because a lot of these deal with the ebbs and flows of an NBA season. For tonight, I think it's pretty basic. If you if you think there's an edge for a home team, take them. Take them against the spread. Home teams in their season opening game where the energy is never gonna be higher, legs are never gonna be fresher, tonight is the night to do it. So I like the Magic, minus 4 against the Houston Rockets. The Knicks, plus 3a half against the Boston Celtics for that same reason. The"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_100",
    "data": {
      "text": "the Houston Rockets. The Knicks, plus 3a half against the Boston Celtics for that same reason. The Memphis Grizzlies, who a lot of people are sleeping on because of no Ja Morant. The Pelicans looked uneven in the preseason. That's plus one for the Grizzlies at home, tough place to play. The Jazz going up against the Kings. I even like the Spurs. So, I mean, I I I feel like it's pretty basic in terms of the way I would handicap tonight. Your thoughts on that before I move on and just generally"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_101",
    "data": {
      "text": "of the way I would handicap tonight. Your thoughts on that before I move on and just generally looking at season opening at home, I just love backing that sort of energy for the most part. Yeah. I mean, it it it what what for 1 or 1 on 1 last night. Right? Warriors weren't really able to to to conjure that up, but, you know, kind of a unique situation without poorly. They shot the ball, and, obviously, the Nuggets were were feeding off of that ring night crowd, but that's, that's kind of a"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_102",
    "data": {
      "text": "obviously, the Nuggets were were feeding off of that ring night crowd, but that's, that's kind of a different ballgame. And I mean I think especially when teams are undervalued, though. It's not something you know, just play it clean across the board. But Yeah. You know, a team like Memphis right now, I I of course, I don't undervalue the Magic. I cover the team, but I think a lot of people nationally do and are overrating the Houston Rockets. The Spurs, I don't know how maybe as a team"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_103",
    "data": {
      "text": "nationally do and are overrating the Houston Rockets. The Spurs, I don't know how maybe as a team undervalued, I think more it's about fading, Kyrie and Luca as a combination. Well, that's good. That's what I wanted to to go back to, and, you know, that'll be the late game on ESPN tonight. Early game, I believe, is Celtics Knicks. So, believe it or not, we're getting a a a natural look at Wembley right away. Dallas, 4 point favorites on the road. Are are you is this like a a singular spot where"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_104",
    "data": {
      "text": "right away. Dallas, 4 point favorites on the road. Are are you is this like a a singular spot where you like the Spurs, or in general, are you a little bit higher on this team? I think with Wabanuyama, they'll be more competitive. Yeah. I do think they're gonna be a competitive team. I love the season opening, new energy aspect, so it's kinda hard to put a value on that, but I I do think there's something to it. And, frankly, Kyrie Irving and and Luca, we don't have a, I I haven't seen yet the"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_105",
    "data": {
      "text": "something to it. And, frankly, Kyrie Irving and and Luca, we don't have a, I I haven't seen yet the official report on on Luca playing tonight. In some ways, I like the Mavericks and the line will move if Luca doesn't play. Kyrie has been winning games with this Mavericks team when he is the lone star. Luca has been winning games with this Mavs team when he's the lone star. What we what we have not seen yet is these 2 stars coming together and winning games, and the line ends up inflated when"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_106",
    "data": {
      "text": "not seen yet is these 2 stars coming together and winning games, and the line ends up inflated when they play together because you've got 2 stars on the floor. So if they're playing tonight and the line stays at 4 or even moves to, like, plus 5 for the spurs, I have to take that and the sprinkle on the money line too. I'm just gonna fade those guys because they're gonna be overvalued based on their name value. Yeah. Another interesting line to me, Chicago, 2 point favorites at home against OKC."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_107",
    "data": {
      "text": "name value. Yeah. Another interesting line to me, Chicago, 2 point favorites at home against OKC. Everybody loves the thunder this year. Yeah. See, that's where it's not it's not universal in the way that I approach this. I think this bulls team is largely just sort of dead in the water. I would say take Chicago, but I have no interest in betting my hard earned American dollars on the on the Bulls when I do have so much belief in OKC this year. So I can't fade the thunder right out of the gate."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_108",
    "data": {
      "text": "when I do have so much belief in OKC this year. So I can't fade the thunder right out of the gate. I've got too much belief in what they can do this year. Yeah. Me too. I I think that's a if if you're looking to target a a road dog tonight, that was one that that I would look at for sure. You know, we'll we'll get our first look at Zion in a regular season setting in quite some time. Pelicans on the road at the grizzlies. It feels like these teams play, like, 15 times a year. Like, they're I"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_109",
    "data": {
      "text": "the road at the grizzlies. It feels like these teams play, like, 15 times a year. Like, they're I don't know. Like They do. There's there's this is, like, a really weird analogy to make, but they they feel like these are this is like an AFC North battle, the Pelicans and the grizzlies. Like, these are kinda like mirror image teams Exactly. For some reason. Oh, then you just nailed it because if the if 2 teams in the AFC North were playing, wouldn't you just blindly take the home underdog? So"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_110",
    "data": {
      "text": "the if 2 teams in the AFC North were playing, wouldn't you just blindly take the home underdog? So Memphis Yeah. It's like a Steelers Browns game. I I can't explain why, but hopefully people understand what I mean. I I completely get it. You know? But that's why Memphis is the play tonight in that regard, and the Pelicans, I I just I I don't think that they figured out exactly how they wanna fit Zion into the mix yet. Balanchunas should have himself a nice game tonight, but by and large, I like"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_111",
    "data": {
      "text": "into the mix yet. Balanchunas should have himself a nice game tonight, but by and large, I like Memphis. So I've got my my 5 spot plays. Yeah. I'll go I'll go 1 by 1, and if you wanna jump in, that's fine, or I can go all the way through, but I'll I'll give you some space here, to comment. Five favorite spot plays throughout the course of the season. One is I fade stars returning off of injury, especially if they've been out for over a week. So this isn't a star missed one night because of load"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_112",
    "data": {
      "text": "if they've been out for over a week. So this isn't a star missed one night because of load management, and then they're right back in the lineup. I'm talking about an extended week to week, month absence, and then the star comes back. Usually, it takes time to reintegrate them. Sometimes the team themselves even finds a groove without that player. There's, they develop some new form of chemistry. And more than anything, when the star returns, it always inflates the line, and usually they're not"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_113",
    "data": {
      "text": "And more than anything, when the star returns, it always inflates the line, and usually they're not great right out of the gate. So in the NBA regular season, watch these ebbs and flows, stars returning to the lineup after extended absences, I usually fade that team. Yeah. I I'm not gonna push back on that too much at all. I I think, you know, for opening night purposes, you know, obviously, it's difficult to to translate that. But, yeah, over the course of the season, no question. And,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_114",
    "data": {
      "text": "it's difficult to to translate that. But, yeah, over the course of the season, no question. And, unfortunately, there's gonna be a lot of those situations, I I think, that pop up. You know, I think we we set the NBA record last year for, you know, most instances of a a major star returning from a an absence of more than 7 to 10 days. So that that's a good note. What else you got? So conversely, these 2 kinda go hand in hand. I would bet teams when the star player is announced out and the line"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_115",
    "data": {
      "text": "these 2 kinda go hand in hand. I would bet teams when the star player is announced out and the line shoots up. So for 1, you get value of extra points in your favor when the star players announce that they're not gonna play. It's a one off situation, though. This is not, if a player is missing night after night. Players usually step up in the absence of a star. So if you it's a game time call and the star player is out, the line is gonna move away from, that particular team. You get extra value"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_116",
    "data": {
      "text": "the star player is out, the line is gonna move away from, that particular team. You get extra value there. This doesn't work for extended stretches, but teams tend to play over their head. Players lesser players play a better version of basketball in a one night situation where they've gotta overcompensate for the lack of a star. So if the Bucks who've been rolling with Giannis, all of a sudden Giannis can't play, the line will move in the direction of the opposing team, jump on the Bucks."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_117",
    "data": {
      "text": "Giannis can't play, the line will move in the direction of the opposing team, jump on the Bucks. Again, this is case by case, but that's usually one that I look for. Yeah. And, again, that's the type of instance that you see all the time, throughout the regular season. And for me, it it would have to be a little bit more opponent dependent. You know, if you're playing a mid to lower level team, then, yeah, you you could kinda see the Bucks, you know, finding a way to to to kinda continue that"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_118",
    "data": {
      "text": "then, yeah, you you could kinda see the Bucks, you know, finding a way to to to kinda continue that rolling without Giannis. Although, I mean, that that might be a tough example this year because I I don't I don't know if the Bucks have quite as much, you know, bench infrastructure around him as they have in years past. Yeah. Joel, I remember playing that spot last year a number of times when Joel Embiid would miss a game, and and then the sixers would step up. You'd see the role guys play"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_119",
    "data": {
      "text": "Joel Embiid would miss a game, and and then the sixers would step up. You'd see the role guys play really well. So, that's something to look for. Don't automatically discard a team because the star is out. Sometimes as long as you get that good closing line value, that's where the value is. Home dogs off of a road loss, assuming that the road trip was short, and that part is really important because you don't want fatigued underdogs at home. This works pretty much in every sport. Home cooking"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_120",
    "data": {
      "text": "you don't want fatigued underdogs at home. This works pretty much in every sport. Home cooking off of a loss, teams tend to lock back in after losing. So pretty simple formula. That's one that you could follow early on. Not a factor tonight, but as the week progresses, that's one to keep an eye on. The length of a road trip matters. For teams that go on extended road trips, like 4 or 5 games, I usually fade them that first night back home. It's the most human element of the NBA. It's the most"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_121",
    "data": {
      "text": "usually fade them that first night back home. It's the most human element of the NBA. It's the most distracted time for NBA players all season. It's even better when you do this during the holidays. Reconnect with friends, reconnect with family, and then boom, all of a sudden I've got a game to worry about and I'm road tired. Those teams, I tend to fade. That's a profitable spot too. As someone who needs, like, 5 holes to warm up after driving, like, 45 minutes to play golf, I I completely I"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_122",
    "data": {
      "text": "who needs, like, 5 holes to warm up after driving, like, 45 minutes to play golf, I I completely I completely empathize with this. Yeah. No. You're you're totally right. And I think a lot of these will be will be great to keep in mind, as the season rolls along. Do you do you have any any spots that you really like on tonight's slate? So, I I mentioned a couple of those home teams, the Memphis Grizzlies. I'm on the the Magic tonight, going up against the Houston Rockets. I think that team,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_123",
    "data": {
      "text": "Grizzlies. I'm on the the Magic tonight, going up against the Houston Rockets. I think that team, could struggle out of the gate just to figure out sort of, who shoots, on that team. In terms of player props, it's actually one of the reasons that I like, the Magic. It it correlates with a player prop I'm playing on the other side. Jalen Green under 22 and a half points scored tonight. He was a volume monster the last couple of years. I think that's gonna take a tick down, and we're gonna see"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_124",
    "data": {
      "text": "volume monster the last couple of years. I think that's gonna take a tick down, and we're gonna see his nightly number shorter than 22a half. That's my prediction moving forward, and it's a little high right now. We're gonna see Fred VanVleet get up a bunch of shots, Dillon Brooks. See how Ahman Thompson factors into the offense. So Yeah. I think that line's a little bit high. And then Victor Wimbunyama, I saw his assist total over under was at 1a half. I'll take the over on that all day."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_125",
    "data": {
      "text": "Wimbunyama, I saw his assist total over under was at 1a half. I'll take the over on that all day. Really? All day. You can find that at underdog. So if you pair that with something else, that I'm actually pairing those 2 together. Jalen Green under 22 and a half and Wen Binyama over 1 and a half assists. We saw during the preseason. It's one of the things that I like the most about his game that doesn't we we did see some highlight reels. His ability to distribute through traffic, he's gonna"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_126",
    "data": {
      "text": "doesn't we we did see some highlight reels. His ability to distribute through traffic, he's gonna get a lot of guys involved. The defense will collapse on him. He's going to get multiple assists tonight, so I feel great about that one. As long as the Jalen Green one can come through, I think the, Wimbin Yama assist prop is is pretty much a lock. I'm not taking too many sides tonight in terms of the the the matchups. I like to play these ebbs and flows of the NBA season. It's really just to sit"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_127",
    "data": {
      "text": "the the matchups. I like to play these ebbs and flows of the NBA season. It's really just to sit back and observe night more than anything else. So a couple of props, a couple of home, couple of home teams in their season opener, and then I'll just sit back and enjoy it. I love the Webb and Yama call. That that's a preposterous line. I I think that's that's that's the one thing I've been more impressed than anything with, with VoIP Manayama. It's like a a lot of the stuff we kind of expected to"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_128",
    "data": {
      "text": "than anything with, with VoIP Manayama. It's like a a lot of the stuff we kind of expected to some degree. You'd seen flashes of it, you know, the shot blocking, the length, the the the finishing that almost doesn't look real sometimes with, like, how little he has to jump or extend just to dunk the ball. But the passing like, that was that was in the in the in summer league in Vegas, you know, when it when it kinda felt like the rest of his game was a little bit shaky. Like, the passing to me"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_129",
    "data": {
      "text": "it when it kinda felt like the rest of his game was a little bit shaky. Like, the passing to me was something that really jumped out. Like, that was not really discussed all that much as part of his his player profile, you know, coming into the draft process, but he is a well above average passer for someone of that size. So, yeah, I I I think, you know, by default, he's gonna probably have, you know, 5, 6, 7 potential assists and just gotta convert a couple of those to go over. I was looking"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_130",
    "data": {
      "text": "know, 5, 6, 7 potential assists and just gotta convert a couple of those to go over. I was looking at the the over 2 and a half threes for Laurie Markkanen. I think that's a guy that picks up where he where he left off last season. You know, it's just pretty heavily to the over for good reason. He averaged 3 made threes per game, a year ago, but, you know, that's one that I I think, you know, could be could be bumped up into, like, more elite territory. It's like the the the best 3 point"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_131",
    "data": {
      "text": "could be could be bumped up into, like, more elite territory. It's like the the the best 3 point shooters on the slate are usually 3 and a half as they're over under. You know, getting that at 2 and a half is is great for now. Good matchup against the Kings. That should be a back and forth game. And, you know, I I I was talking about this. I I took market in in my NFBKC draft the other night. It was talk about it on the live stream, which I just talked for 90 minutes straight kinda to myself."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_132",
    "data": {
      "text": "was talk about it on the live stream, which I just talked for 90 minutes straight kinda to myself. Like, there are some people leaving comments, but it was overwhelmingly just me, you know, just saying whatever I want. That's the dream. You know, something I I hadn't really thought about, you don't really hear about with marketing is, like, alright. We have one sample of him being, you know, one of the 25 to 30 best Fantasy players in the league, and we have 5 years of him just being, like, a"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_133",
    "data": {
      "text": "of the 25 to 30 best Fantasy players in the league, and we have 5 years of him just being, like, a pretty average player. Is is it fair to assume that the guy he was last year is just who he's going to be going forward? For the sake of my team, I hope the answer is yes, but I I wanna get your opinion on that. No. I I think that that's the case. That, when he found he found himself a home in Utah, and they used him perfectly. I I think that his it took him a minute to to grow into who he was"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_134",
    "data": {
      "text": "and they used him perfectly. I I think that his it took him a minute to to grow into who he was gonna be in the NBA, and then we see this all the time. And sometimes it takes finding the right spot in order to completely unlock that. He found that last year. Not a lot of change in terms of that lineup outside of the addition of John Collins. So, yeah, why not? And and I love that prop for tonight, especially at home crowd behind you going up against a bad defense. He should be chucking up"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_135",
    "data": {
      "text": "especially at home crowd behind you going up against a bad defense. He should be chucking up shots. Alright. Before we get out of here, Brandon, any any kind of, like, under the radar, sneaky storylines that you're keeping an eye on tonight? Any, like, random, you know, rotation questions, any games on this slate that, you know, maybe aren't the obvious ones that you'll be keeping, a very close eye on? Like, I I really wanna watch the Blazers tonight. I'm excited to see what they look like"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_136",
    "data": {
      "text": "eye on? Like, I I really wanna watch the Blazers tonight. I'm excited to see what they look like against the Clippers. You know, Thunderbulls is gonna be a lot of fun. Like, I'm excited to see, you know, year 3 of Scottie Barnes. You know, you can you can kinda pick out something from every game, but what what is catching your eye? Yeah. I mean, this one is definitely not under the radar, but I wanna see this new look Celtics team. I wanna see what Porzingis and Jrue Holiday look like in in a"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_137",
    "data": {
      "text": "wanna see this new look Celtics team. I wanna see what Porzingis and Jrue Holiday look like in in a real game that matters, especially a tough road game. I actually kinda like the Knicks plus 3a half. I don't know that I'm willing to play it, but I'm at least willing to say that I like it. The the Knicks tend to play the Celtics tough, and the Celtics are coming in so overhyped. What are they gonna look like out of the gate? So it's far from under the radar, but I think that this team has the"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_138",
    "data": {
      "text": "look like out of the gate? So it's far from under the radar, but I think that this team has the potential to lead the NBA in regular season wins. How good do they look right out of the gate? And then, you know, I'll be at the Magic game tonight, so I'm curious to see, obviously, what they look like, but there's a lot of continuity with that roster. So it's really just about playing to the level that I think they're capable of, which is slightly above 500. I wanna see what Ahman Thompson looks"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_139",
    "data": {
      "text": "that I think they're capable of, which is slightly above 500. I wanna see what Ahman Thompson looks like and Cam Whitmore when games actually matter. Whitmore was a summer league star, but I'm really excited to watch those 2 play. And, actually, later on today on my show, I'm gonna talk to the overtime elite general manager, Damian Wilkins, who ran the show for, the team that Ahmed and Oser played for. So curious to get his thoughts on what those guys bring to the table. They seem like special"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_140",
    "data": {
      "text": "for. So curious to get his thoughts on what those guys bring to the table. They seem like special players, so I'll have my eye on both of them tonight, but up close and personal with Ahmed. I've been pretty impressed with how those guys have looked starting in summer league when we we saw limited action, especially out of Ahmed, but, in the preseason as well. Like, I I I I think we there was kind of this general perception of the overtime league. It's like, alright. What what the heck is this?"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_141",
    "data": {
      "text": "of this general perception of the overtime league. It's like, alright. What what the heck is this? Is this just like a professional AAU team? Like, who are these guys playing against? But they they there doesn't look like there's been, you know, this, like, jump up in competition where these guys are drowning. Like, they they look the part. They absolutely have passed the eye test so far. So I I'm really excited to see what both of those guys look like. I'm I'm a little bit higher on ASAR for"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_142",
    "data": {
      "text": "really excited to see what both of those guys look like. I'm I'm a little bit higher on ASAR for Fantasy just because I think he's in a better position. You know, obviously, being that they are twins, they have very similar skill sets and very similar, you know, strengths and deficiencies. But I I think Assar has a clear path to, you know, seeing 25 to 30 minutes most nights. Whereas there's there's still a lot of overlap on this Rockets roster between Green, Thompson, Brooks, you know,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_143",
    "data": {
      "text": "there's still a lot of overlap on this Rockets roster between Green, Thompson, Brooks, you know, Whitmore, you mentioned. Like, they still got guys like Reggie Bullock, Jayshaun Tate, Tari Eason hanging around on the wing as well. So, very interested to see how that rotation shakes out. Yeah. I I'm I am really excited about being at that game tonight because if I were sitting back at home as just an NBA nerd, what's my league pass game of the night? I think it would be Magic Rockets. Speaking"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_144",
    "data": {
      "text": "an NBA nerd, what's my league pass game of the night? I think it would be Magic Rockets. Speaking at at this completely objectively, just these two teams with all of the young talent that both of those rosters have, the complete unknowns with the Houston Rockets and the additions that they made, Ayme Udoka back on the sideline. There's so many interesting little storylines that aren't gonna get the national pub, but for NBA for, fans, there's a lot of intrigue with this game. Alright. We'll end"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_145",
    "data": {
      "text": "national pub, but for NBA for, fans, there's a lot of intrigue with this game. Alright. We'll end on this. What would you say is your your worst game of the night? The game that you are least interested in. For for me, we got some candidates like Hawks, Wizards, Pacers, Pistons, Heat. Wizards, Pacers, without a doubt. I will avoid as many Wizards games as I can this year, and the Pacers, I kinda know what they are. You know, they're a team that's gonna they'll fly up and down the court. That"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_146",
    "data": {
      "text": "know what they are. You know, they're a team that's gonna they'll fly up and down the court. That they, they'll probably score a lot of points. They don't play a lot of defense, and, I'm sure Halliburton will have himself a great night tonight, but I have no interest in I have no need to, have that on a screen at any point tonight. Yeah. To to make another, like, really forced egregious NFL reference, like, this this is like getting, like, Giants and Commanders week 1 Sunday night football."
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_147",
    "data": {
      "text": "like, this this is like getting, like, Giants and Commanders week 1 Sunday night football. Well, thankfully, this is Sunday night football means that's the only game that you can watch. You got plenty of other options. I don't know where you have to be where this is your only option tonight. Yeah. I I yeah. I guess you just have to be in Indiana or DC and have access to nothing but local television. I I'm I'm interested in both of these teams. I don't wanna jump on them too much. I just I'm not"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_148",
    "data": {
      "text": "I I'm I'm interested in both of these teams. I don't wanna jump on them too much. I just I'm not interested in them playing each other. Like, I I I have curiosity about the Pacers. I wanna watch Halliburton. I wanna see Matherin in the starting lineup. You know, the Wizards have a lot of interesting pieces for Fantasy, but no. Not not not together. This is too much. Alright. We gotta cut it off here, Brandon. We got we got things to do. We got a a big 12 game slate to prepare for. Wanna thank"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_149",
    "data": {
      "text": "here, Brandon. We got we got things to do. We got a a big 12 game slate to prepare for. Wanna thank you for for taking the time. As always, looking forward to continuing to do these episodes each Wednesday. We'll try to give you, you know, kind of a mix of a a recap of the previous night, and then a preview of the Wednesday slate each week. Although, it's usually, like, 8, 10, 12 games. So, yeah, we can only go so deep on these. But, as we get more into the fantasy season, you know, we'll have"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_150",
    "data": {
      "text": "we can only go so deep on these. But, as we get more into the fantasy season, you know, we'll have more and more to to recap, but we'll talk about, you know, some roster moves, players we're adding, players we're dropping as the season goes along. You know, make sure you you check out the rotor wire YouTube page, rotor wire fantasy basketball YouTube, I should say. We launched that, what, like, three and a half weeks ago, Brandon. We already blew past a 1000 subscribers, so we thank everybody,"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_151",
    "data": {
      "text": "and a half weeks ago, Brandon. We already blew past a 1000 subscribers, so we thank everybody, who's gone over there, who's liked our videos, who subscribed, and everybody who follows along on Twitter as well. And, of course, if you're listening to the audio version of this, you could find it on Spotify. You could find it on Apple Podcasts or wherever you get your podcast. Doctor Ray will be back on the show tomorrow. We'll have Ken, Alex, and Shannon on Friday. They'll be talking week 1 waiver"
    }
  },
  {
    "id": "opening_night_takeaways_lebrons_workload_harden_updates_wednesday_night_preview_152",
    "data": {
      "text": "on the show tomorrow. We'll have Ken, Alex, and Shannon on Friday. They'll be talking week 1 waiver wire. Make sure you don't miss either of those episodes. For Brandon Kravitz, I'm Nick Whalen. We're out."
    }
  }
]